[
  "MongoDB, Inc. (NASDAQ:MDB) Q4 2024 Earnings Call Transcript March 7, 2024 5:00 PM ET",
  "Company Participants",
  "Brian Denyeau - IR, ICR Dev Ittycheria - President and CEO Michael Gordon - COO and CFO",
  "Conference Call Participants",
  "Sanjit Singh - Morgan Stanley Raimo Lenschow - Barclays Kash Rangan - Goldman Sachs Brent Bracelin - Piper Sandler Brad Sills - Bank of America Rishi Jaluria - RBC Tyler Radke - Citi",
  "Operator",
  "Thank you for standing by and welcome to MongoDB's [Technical Difficulty] At this time, all participants are in a listen-only mode. After the speaker's presentation [Technical Difficulty] question-and-answer session. [Operator Instructions] [Technical Difficulty] I will now turn the conference over to your host, Mr. Brian Denyeau. [Technical Difficulty] Go ahead.",
  "Brian Denyeau",
  "Thanks, Valerie. Good afternoon, and thank you for joining us today to review MongoDB's fourth quarter fiscal 2024 financial results, which we announced in our press release issued after the close of market today. Joining me on the call today are Dev Ittycheria, President and CEO of MongoDB, and Michael Gordon, MongoDB's COO and CFO.",
  "During this call, we will make forward-looking statements, including statements related to our market and future growth opportunities, our expectations for the macroeconomic environment in fiscal 2025 and the impact of AI, the benefits of our product platform, our competitive landscape, customer behaviors, our financial guidance, and our planned investments. These statements are subject to a variety of risks and uncertainties, including the results of operations and financial conditions, that cause actual results to differ materially from our expectations. For discussion of material risks and uncertainties that could affect our actual results, please refer to the risks described in our quarterly report on Form 10-Q for the quarter ended October 31, 2023, filed with the SEC on December 7, 2023. Any forwarding-statements made in this call reflect our views only as of today, and we undertake no obligation to update them except if required by law.",
  "Additionally, we will discuss non-GAAP financial measures on this conference call. Please refer to the tables in our earnings release on the investor relations portion of our website for reconciliation of these measures to the most directly comparable GAAP financial measures.",
  "With that, I'd like to turn the call over to Dev.",
  "Dev Ittycheria",
  "Thanks, Brian, and thank you to everyone for joining us today. I'm pleased to report that we had another strong quarter that capped off an impressive year as we continue to execute well to capture a large market opportunity. I will start by reviewing our fourth quarter and full year results before giving you a broader company update.",
  "Starting with the fourth quarter, we generated revenue of $458 million, a 27% year-over-year increase and above the high end of our guidance. Atlas revenue grew 34% year-over-year, representing 68% of revenue. We generated non-GAAP operating income of $69.2 million for a 15% non-GAAP operating margin, and we ended the quarter with over 47,800 customers. Overall, we are pleased with our performance in the fourth quarter. We had a healthy quarter of new business led by continued strength in new workload acquisition within our existing Atlas customers. In addition, our Enterprise Advanced business again exceeded our expectations, demonstrating strong demand for our platform and the appeal of our run anywhere strategy.",
  "Moving on to Atlas consumption trends, the quarter played out in line with our expectations and we saw a stronger consumption than in Q4 last year. Michael will discuss consumption trends in more detail. Finally, retention rates remained strong in Q4, reinforcing the quality of our product and the mission criticality of our platform. Stepping back and looking at fiscal â\u0080\u009824 as a whole, I'm proud of what we accomplished. We achieved revenue growth of 31% and a non-GAAP operating margin of 16%, well above our initial expectations. Atlas grew 37% year-over-year, and we added over 7,000 customers, ranging from AI startups to Fortune 500 companies. We had a record year of fast-paced innovative product releases such as Vector Search, Queryable Encryption, and the preview of Atlas Stream Processing, reinforcing why so many customers and developers choose MongoDB's developer data platform. Finally, we continue to innovate on our go-to-market motion to drive workload acquisition.",
  "As we look into fiscal â\u0080\u009825, let me share with you what I see in the market. First, I'm excited about our opportunity to win new business. In today's digital world, customers express their business strategy through software. The software [indiscernible] strategy that one of the most important investments a company can make is in the productivity of its software developers. Consequently, customers are gravitating towards MongoDB as their next generation developer data platform standard. Second, I see stable consumption growth going into next year. Atlas consumption trends have been steady for several quarters now, and we experienced less consumption variability in fiscal â\u0080\u009824 compared to fiscal â\u0080\u009823. Ultimately, the main driver of Atlas consumption is the growth in the underlying application usage and we see stable usage growth across our portfolio of workloads.",
  "Third, while I strongly believe that AI will be a significant driver of long-term growth for MongoDB, we are in the early days of AI, akin to the dial-up phase of the Internet era. To put things in context, it's important to understand that there are three layers to the AI stack. The first layer is the underlying compute and LLMs. The second layer is the fine-tuning of models and building of AI applications. And the third layer is deploying and running applications that end users interact with. MongoDBâ\u0080\u0099s strategy is to operate at the second and third layers to enable customers to build AI applications by using their own proprietary data together with any LLM, close or open source, on any computing infrastructure. Today the vast majority of AI spend is happening in the first layer, that is investments in compute to train and run LLMs. Neither are areas in which we compete. Our enterprise customers today are still largely in the experimentation and prototyping stages of building their initial AI applications, first focus on driving efficiencies by automating existing workloads. We expect that it will take time for enterprises to deploy production workloads at scale. However, as organizations look to realize the full benefit of these AI investments, they will turn to companies like MongoDB, offering differentiated capabilities in the upper layers of the AI stack. Similar to what happened in the internet era, when value accrued over time to companies offering services and applications leveraging the built-out Internet infrastructure, platforms like MongoDB will benefit as customers build AI applications to drive meaningful operating efficiencies, create compelling customer experiences, and pursue new growth opportunities. We already see our platform resonating with innovative AI startups building exciting applications for use cases such as real-time patient diagnostics for personalized medicine, cyber threat data analysis for risk mitigation, predictive maintenance for maritime fleets, and auto-generated animations for personalized marketing campaigns.",
  "Finally, our competitive position is getting stronger. Our win rates remain very high across all competitors. We rarely compete with legacy database providers as enterprises understand that they need to move away from inefficient and brittle legacy technology. We also rarely run into niche database players since customers are overwhelmed by the proliferation of point solutions that are hard to manage and add limited value. Our main competition remains the cloud players. They offer a wide array of database options, relational and non-relational, and benefit from their size and reach. We compete well against these players due to the flexibility and scalability of our document architecture. The fact that our open platform can run anywhere and avoids lock-in and MongoDB's popularity among developers all around the world.",
  "Finally, when you look at our newer products, we see increased success competing against the established players in those markets. We find that the same principle applies as in the core database market. Customers don't want to manage a myriad of point solutions and prefer consolidating their spend with strategic vendors, especially in the current cost conscious environment. In summary, we expect the environment in fiscal â\u0080\u009825 to be largely similar to the environment we experienced in fiscal â\u0080\u009824.",
  "With that backdrop, let me tell you what our priorities are going to next year. First, we'll continue pressing our product advantage in the core database, since we believe customers will place an even greater premium on performance and scalability in the AI enabled world. In addition, we'll continue maturing our newer products, including additional features of Vector Search, GA of Atlas Stream Processing, and enhancements to other offerings. Second, we will remain singularly focused on new workload acquisition as the key long-term driver of our business. We will continue fine-tuning incentives to ensure that our entire go-to-market organization is focused on identifying and sourcing new workload opportunities. In addition, we will leverage our expertise and learnings from our self-serve business to use product-led growth techniques to increase the adoption of Atlas by other development teams within our existing large enterprise accounts. Third, we are focused on growing sales capacity. As we told you in the past, we were slow to grow capacity in fiscal â\u0080\u009824, especially in the first half due to macro uncertainty. Given that the market is more stable now and that we remain under-penetrated compared to our opportunity, we'll increase the pace of go-to-market investments in fiscal â\u0080\u009825. Fourth, we will continue investing to become a standard in more of our customer base. We intend to double the size of our strategic account program and dramatically expand our account-based marketing efforts in our largest accounts. Finally, we remain focused on locking the relational migration opportunity. To remind everyone, there are three elements to migrating an application, transforming the schema, moving the data, and rewriting the application code. Our current relational migrator offering is designed to automate large parts of the first two elements, but rewriting application code is the most manually intensive element. GenAI holds tremendous promise to meaningfully reduce the cost and time of rewriting application code. We will continue building AI capabilities into Relational Migrator, but our view is that the end solution will be a mix of products and services. This year, we are investing in a number of pilots leveraging AI for relational migrations paired with services to substantially simplify and scale the process.",
  "Now I'd like to spend a few minutes reviewing the adoption trends of MongoDB across our customer base. Customers across industries around the world are running mission-critical projects on MongoDB Atlas, leveraging the full power of a developer data platform, including ZF, Forbes, and Swiss Federal Railways. ZF, a global technology company supplying systems for passenger cars, commercial vehicles, and industrial technology, needed a central database solution with broad functionality to support more than 300,000 commercial vehicles connected to ZF infrastructure. ZF originally began using MongoDB on-premise in 2014 and migrated to MongoDB Atlas to modernize the architecture behind its new fleet orchestration solution. The team now uses time series and online archive to reduce the overall data storage size, as well as MongoDB Atlas Search to manage indexes and Atlas Charts to display billing information. MongoDB's developer data platform enables ZF to release new features faster as innovative technologies like drones and autonomous vehicles continue to come to market.",
  "In any -- PicPay and Anywhere Real Estate are examples of customers turning to MongoDB to free up the developers' time for innovation while achieving significant cost savings. Anywhere Real Estate, a global leader in residential real estate services whose brand portfolio includes Better Homes and Gardens, Century 21, Coldwell Banker, Corcoran, ERA, Sotheby's International Realty, is leveraging MongoDB Atlas and Atlas Search to greatly enhance its search capabilities. Their previous solution was too costly and operationally burdensome to maintain. Now with Atlas Search, they can ingest data from hundreds of MLS sources, aggregate the data and provide customers with a search solution that efficiently delivers accurate and up-to-date information, saving time and lowering costs. Anywhere is also exploring the use of Atlas Vector Search to provide semantic search and GenAI features to millions of consumers.",
  "Samsung Electronics, ArcelorMittal and Citizens Bank are turning to MongoDB to marinize applications. Samsung Electronics digital appliances division transitioned from their previous MySQL database to MongoDB Atlas to manage their clients data more effectively. By leveraging MongoDB's document model, Samsungâ\u0080\u0099s smart home service can collect real-time data from the team's AI-powered home appliances and use it for a variety of data-driven initiatives such as training AI services. Their migration to MongoDB Atlas improved response times by more than 50% and disk read latency was reduced from 3 seconds to 18 millisecond, significantly improving availability and developer productivity.",
  "Let me wrap up by saying that I remain highly confident about our ability to execute on our long-term growth opportunity. We are pursuing one of the largest and fastest-growing markets in all of software, with significant expansion opportunities in both new and existing customer accounts. While it's early days, we expect that AI will not only support the overall growth of the market, but also compel customers to revisit both their legacy workloads and build more ambitious applications. This will allow us to win more new and existing workloads and to ultimately continue to establish MongoDB as a standard in enterprise accounts.",
  "Before I turn it over to Michael, I would like to personally invite all of you to attend the investor session at MongoDB.localNYC to be held at the Javits Center on May 2nd. Please email ir@mongodb.com if you're interested in attending.",
  "With that, here's Michael.",
  "Michael Gordon",
  "Thanks, Dev. As mentioned, we delivered a strong performance in the fourth quarter both financially and operationally. I'll begin with a detailed review of our fourth quarter results and then finish with our outlook for the first quarter and full fiscal year 2025. First I'll start with our fourth quarter results. Total revenue in the quarter was $458 million, up 27% year-over-year, and above the high end of our guidance. As Dev mentioned, we had another quarter of healthy new business acquisition, demonstrating our product market fit and the mission criticality of our platform.",
  "Shifting to our product mix, let's start with Atlas. Atlas grew 34% in the quarter compared to the previous year and now represents 68% of total revenue compared to 65% in the fourth quarter of fiscal 2023 and 66% last quarter. We recognize Atlas revenue primarily based on customer consumption of our platform, and that consumption is closely related to end user activity of the application. As a reminder, in Q4 fiscal â\u0080\u009823, we had a higher than normal amount of revenue from unused commitments, making this a tough year-over-year comparison. Excluding the impact of unused commitments, Atlas year-over-year growth in Q4 was in line with the growth that we observed in Q3.",
  "Let me provide some additional context on Atlas consumption in the quarter. As we shared in our guidance last quarter, we were expecting consumption to be impacted by the seasonal slowdown in Q4 around the holidays. Week-over-week consumption growth in Q4 was stronger than in Q4 of last year and in line with our expectations. We've seen less consumption variability this year, and so as in Q3 we forecasted less of a seasonal impact than in prior years and that's exactly what we saw.",
  "Turning to non-Atlas revenue, EA exceeded our expectations in the quarter and we continue to have success selling incremental workloads into our existing EA customer base. Ongoing EA strength speaks to the appeal and success of our run anywhere strategy. The EA revenue app performance was in part a result of more multi-year deals than we had expected. As a reminder, the term license component for multi-year deals is recognized as upfront revenue at the start of the contract and therefore includes term license revenue related to future years.",
  "Turning to customer growth, during the fourth quarter, we grew our customer base by approximately 1,400 customers sequentially bringing our total customer count to over 47,800, which is up from over 40,800 in the year-ago period. Of our total customer count, over 7,000 are direct sales customers, which compares to over 6,400 in the year-ago period. The growth in our total customer count is being driven primarily by Atlas, which had over 46,300 customers at the end of the quarter, compared to over 39,300 in the year-ago period. It's important to keep in mind that the growth of our Atlas customer count reflects new customers to MongoDB, in addition to existing EA customers, adding incremental Atlas workloads.",
  "Moving on to ARR, we had another quarter with our net ARR expansion rate above 120%. We ended the quarter with 2,052 customers with at least $100,000 in ARR and annualized MRR, which is up from 1,651 in the year-ago period. We also finished the year with 259 customers spending a million dollars or more annualized on our platform compared to over 213 a year ago.",
  "Moving down the income statement, I'll be discussing our results on a non-GAAP basis unless otherwise noted. Gross profit in the fourth quarter was $353.6 million, representing a gross margin of 77%, which is down from 78% in the year-ago period. As we said at the time, our gross margin in the year-ago period reflected a one-time benefit of roughly 2.5 percentage points related to one of our cloud partner contracts. Our income from operations was $69.2 million, or a 15% operating margin for the fourth quarter, compared to a 10% margin in the year-ago period. Our strong bottom-line results demonstrate the significant operating leverage in our model and are a clear indication of the strength in our underlying unit economics. The primary reason for our operating income results versus guidance is our revenue outperformance. Net income in the fourth quarter was $71.1 million, or $0.86 per share, based on 82.9 million diluted weighted average shares outstanding. This compares to net income of $46.4 million, or $0.57 per share, on 80.8 million diluted weighted average shares outstanding in the year-ago period.",
  "Turning to the balance sheet and cash flow, we ended the fourth quarter with $2 billion in cash, cash equivalents, short-term investments, and restricted cash. Operating cash flow in the fourth quarter was $54.6 million and $121.5 million for the full fiscal year 2024. After taking into consideration approximately $4.1 million in capital expenditures and principal repayments of finance lease liabilities, free cash flow was $50.5 million in the quarter. This compares to free cash flow of $23.8 million in the fourth quarter of fiscal 2023. For the full fiscal year â\u0080\u009824, free cash flow was $109.9 million compared to negative $24.7 million in fiscal â\u0080\u009823.",
  "I'd now like to turn to our outlook for the first quarter and full fiscal year 2025. For the first quarter, we expect revenue to be in the range of $436 million to $440 million. We expect non-GAAP income from operations to be in the range of $22 million to $25 million and non-GAAP net income per share to be in the range of $0.34 to $0.39 based on 83.8 million estimated diluted weighted average shares outstanding. For the full fiscal year 2025, we expect revenue to be in the range of $1.9 billion to $1.93 billion, non-GAAP income from operations to be in the range of $186 million to $201 million, and non-GAAP net income per share to be in the range of $2.27 to $2.49, based on 85.1 million estimated diluted weighted average shares outstanding. Note that the non-GAAP income per share guidance for the first quarter and full fiscal year 2025 includes a non-GAAP tax provision of approximately 20%.",
  "I'll now provide some more context on our guidance, starting with the full year fiscal â\u0080\u009825, where we're facing difficult compares in two ways. First, we expect to recognize close to zero revenue from unused Atlas commitments in fiscal 25, compared to over $40 million in fiscal â\u0080\u009824. As you may recall, in fiscal â\u0080\u009824, we changed our sales incentive structure to reduce the importance of upfront commitments. And so we saw far fewer upfront commitments. Therefore, as those fiscal â\u0080\u009925 -- â\u0080\u009824 deals come up for renewal in fiscal â\u0080\u009825, we expect to see limited revenue related to unused commitments. Second, in fiscal â\u0080\u009824, we recognized approximately $40 million more in multiyear license revenue than we did in fiscal â\u0080\u009823. As you know, our fiscal year â\u0080\u009824 non-Atlas revenue benefited from a higher-than-usual amount of license revenue related to multi-year contracts, including our extended partnership with Alibaba. Clearly we are pleased with the fiscal â\u0080\u009824 performance, but it was unusual in terms of the magnitude of multi-year deals and we don't expect similar performance in fiscal â\u0080\u009825. As a result, we expect non-Atlas revenues to be modestly down in fiscal â\u0080\u009825. Next, we expect Atlas consumption growth to be in line with the consumption growth we've experienced in fiscal â\u0080\u009824.",
  "Finally, I want to provide some context to better understand our operating margin guidance. The $80-plus-million of fiscal â\u0080\u009824 revenue that won't repeat in fiscal â\u0080\u009825 was very high margin, making for an exceptionally tough operating margin compare. In addition, as we mentioned in the past, in fiscal â\u0080\u009824 we began increasing our pace of hiring relatively late in the year. So the full cost from those investments will impact our fiscal â\u0080\u009825 operating margin. We're expecting headcount growth in the mid-teens versus 9% growth in fiscal â\u0080\u009824. And as Dev mentioned, we are prioritizing growth in sales productive capacity. Consequently, we expect to see a year-over-year operating margin decline while still delivering 500 basis points of margin expansion on a two year basis. We believe this is the most appropriate way to understand our continued margin progression.",
  "Moving on to our Q1 guidance, a few things to keep in mind. First, we expect Atlas revenue to be flat to slightly down sequentially. Q1 has two fewer days than Q4 this year, which represents a revenue headwind. Also, the slower Atlas consumption growth during the holidays will have a bigger impact on Q1 revenue than it did in Q4, thereby negatively impacting sequential revenue growth. Finally, the sequential impact from the expected decline in unused Atlas commitments will be most pronounced in Q1, given that we made the changes in Q1 of last year. Second, we expect to see a meaningful sequential decline in EA revenue. As discussed in past years, Q4 is our seasonally highest quarter in terms of our EA renewal base, which is an excellent indicator of our ability to win new EA business. In Q1, the EA renewal base is sequentially much lower. Finally, we expect operating income to decline sequentially due to lower revenue as well as our increased pace of hiring.",
  "To summarize, MongoDB delivered strong fourth quarter results. We're pleased with our ability to win new business and see stable consumption trends in Atlas. We remain incredibly excited about the opportunity ahead and will continue to invest responsibly to maximize our long-term value.",
  "With that, we'd like to open it up to questions. Operator?",
  "Question-and-Answer Session",
  "Operator",
  "[Operator Instructions] Our first question comes from the line of Sanjit Singh of Morgan Stanley. Your line is open.",
  "Sanjit Singh",
  "Thank you for taking the question. Michael, I wanted to walk through the guidance with you a little bit. This time last year, coming out of Q4 â\u0080\u009823, it was a pretty different environment, a much more cautious environment. I think usage growth was particularly impacted in Atlas last year. This year coming into fiscal year â\u0080\u009825, things feel a little bit healthier or at least stable in sort of how you guys are framing it. And yet the guidance, the initial guidance for growth looks a lot like the initial guidance growth for last year. Just trying to understand, and I know you talked about some of the one-time impacts from last year, but just in terms of a better spending environment versus an initial guide that looks also pretty similar to last year, could you sort of frame out like the conservatism that you have embedded in guidance.",
  "Michael Gordon",
  "Yeah. So a couple of things. Thanks for the question. Yeah, I think the key thing is, once you adjust for those one-time items that we called out, we see a stable environment. That's what we described and experienced in Q4 compared to Q3. So we feel good about that. I think just to underscore, there's the $80 million in revenue that won't repeat both from the unused commitments as well as from the multi-year deals. And when you adjust from those, we feel good about the dynamic. To your question, which is sort of embedded in that around, sort of I'll call it, guidance approach or approach to guidance, we haven't changed our view as it relates to guidance. We have seen more stable consumption that obviously gives us higher confidence, in part given the less variability that we've seen over the course of fiscal â\u0080\u009824. I think we also have a better understanding of the underlying seasonality of the business. We had updated at the end of last year in our call, in our Q3 call, around the success that we're having on EA, and we had updated those EA new business assumptions, and so that our guidance reflects kind of continued strength there. So I think that's how we approach it, but there are no fundamental changes, but hopefully we've given you a fair amount of the piece parts so people can help do the math.",
  "Sanjit Singh",
  "Yeah, I really appreciate that. And thank you for breaking out that $80 million between unused commitments and the multi-year term license field. On the unused commitment side of the house, that $40 million, can you give us a sense of how that flowed through to the balance of the year? Obviously, it doesn't look like it all came in Q4, But the prior year in Q4, you also mentioned a $7 million impact to Atlas revenue that quarter. Was that impact worse or better this year when we think about the unused commitment contribution to this quarter's Atlas results?",
  "Michael Gordon",
  "Yeah, so I think the key thing is the $40 million will happen over the course of the year. It obviously tracks to the actual contracts. It affects a relatively small number of customers and a small percentage of the commitments. It's a dynamic that goes away over time as we've discussed. We do -- we particularly called out that on a sequential basis it'll be most obvious and most pronounced in Q1 because we're basically hitting the first wave of those renewals where we don't have commits. And so especially as people are trying to do the sequential math, we just wanted to call that out and make sure people sort of understood that dynamic.",
  "Sanjit Singh",
  "Understood. Congrats on the Q4.",
  "Michael Gordon",
  "Thanks.",
  "Operator",
  "Thank you. One moment please. One moment. [Technical Difficulty] Raimo Lenschow of Barclays. Your line is open.",
  "Raimo Lenschow",
  "Thank you. Congrats on a nice Q4. Question also a little bit on guidance, Mike. The last two quarters before Q4, we talked about EA seeing a little bit of a tailwind from customers kind of maybe modernizing on-premise rather than going to Atlas to kind of still modernize but maybe not spending all the money to go to the cloud. Is that trend still valid? And if you think about the multi-year commitments, obviously you had the $10 million, $15 million for the Alibaba deal, but then the other stuff is like customers that are just doing this work. Do you think that will change and people go back to like shorter commitments or is it just more that you're kind of thinking about the renewal pool? Thank you.",
  "Michael Gordon",
  "Yeah, so a few different things embedded in there. On the multi-year, it's always been a dynamic, and as we've seen deals or variability, we've tried to call that out, and that's why we sort of call out, given under the ASC 606, that increased variability and reduced comparability that comes from EA. Obviously, Atlas has grown as a percentage of the business, but that continues to be the dynamic for the EA portion. I expect that we will continue to see multi-year deals, but we -- just in fiscal â\u0080\u009824, it was just so many more than we thought, and to your point, not just EA, but broadly non-Atlas. And it's just -- it's not something that we'll repeat in fiscal â\u0080\u009825. And so that's why we wanted to call it out and quantified it. On the first part of your question on modernization, the way I would think about it is, customers all have their own IT strategies including deployment including their cloud postures and things like that. That's for them to decide. We want to make MongoDB easy for them to consume. Our run Anywhere strategy has proven to be successful. And we've seen that in the EA performance. And so I think the other thing I'd add is we have increasingly seen people appreciate, even if they're operating in a business or maybe in a regulated environment where they can't fully move to the cloud, where they do want to start to modernize applications and modernize infrastructure, and MongoDB is seen -- Enterprise Advance is seen now as an on-ramp to the cloud, even if you can't fully modernize and put yourself into a public cloud setting, EA can help that. Because eventually, given the [run-in to our] (ph) strategy, it will make it easier for your ultimate move to the cloud if that's what you wind up doing.",
  "Raimo Lenschow",
  "Okay, perfect. Thank you.",
  "Operator",
  "Thank you. [Operator Instructions] Our next question comes from Kash Rangan of Goldman Sachs. Your line is open.",
  "Kash Rangan",
  "Hey, thank you very much. Congrats on the results. One quick one for Dev and one hopefully quick one for Michael as well. Dev, you talked about Generative AI applications. You described the three layer architecture. When do you think it hits the sweet spot of how MongoDB is positioned from a timing standpoint? When do these Generative AI applications start to really drive underlying need for the kind of databases that you're best suited for? One for Michael. In your assumptions, when I take away the $40 million of the upfront, that's like a couple of percentage points of growth. I'm just trying to understand what kind of consumption trends you are using to build guidance? Was it average of fiscal â\u0080\u009824 consumption trends or weighted more to its second half or exiting fourth quarter? Any color there would be tremendously useful. And also want to ensure the sales force is still selling EA and can get comp for EA because it does not look like you're giving much weight for EA in your forecast. That's it for me. Thank you.",
  "Dev Ittycheria",
  "Thanks, Kash. I'll take the first question. In regards to when we see enterprises deploying [indiscernible] production, I think it's a combination of customers getting comfortable with the technology and also these technologies maturing from both a performance and from a cost point of view. If you played with ChatGPT or any of the other chatbots out there or large language models, you'll know that the performance of these applications, you need to get response time in the one to two to three seconds, depending on the type of question you're asking. And so naturally a chatbot is a very simple but easy to understand use case, but to embed that technology into a sophisticated application, making real-time decisions based on real-time data, the performance and to some degree, the cost of these architectures are still not there. Also, customers are still in the learning phase. They're experimenting, they're prototyping, but I would say you're not seeing a lot of customers really deploy AI applications at scale. So I think it's going to take them, I would say this year is a year where they're going to do, you know, probably roll out a few applications, learn, and then as they get more experience, become more comfortable in rolling out more and more applications as they get -- as both these technologies mature and the costs come down. We feel very good about our positioning because from an architecture point of view, the document model, the flexible schema, the ability to handle real time data, performance at scale, the unified platform, the ability to handle data, metadata, and vector data with the same query language, same semantics, et cetera, is something that makes us very, very attractive. The other thing that we're finding is unlike a typical sale where someone's deciding to either build a new workload or monetize a workload, the AI decision is more of a central decision -- centralized decision more than ever. So it allows us to actually go higher in the organization. So we're actually engaging with customers at much more senior levels because obviously this is coming down as a top down initiative. And so this allows us to position us as a very modern platform designed for these new modern use cases and workloads. So we feel good about a positioning, but as I said this year I think is going to be continued experimentation and rollout of some individual applications.",
  "Michael Gordon",
  "And then on the consumption questions, Kash, thanks for that. Overall, if you look at the guidance and the piece parts that we've tried to share with you, when you take into account the $80 million of impact from the unused commitments and the multi-year outperformance, you'll see at the top line level around 500 basis points of headwind. And then we also walked you through our expectations that the non-Atlas will be modestly down, given the $40 million of that part that isn't recurring. So when you kind of piece all those together, you'll wind up probably coming to a conclusion that Atlas looks consistent from a consumption growth standpoint, and that's in line with the stable trends we've seen over the course of fiscal â\u0080\u009824. So we're using those fiscal â\u0080\u009824 numbers. Obviously there's some seasonal adjustments that we have factored in there, but that's really what we're seeing there. And then the last part of your question around EA, we are -- we do still sell EA, we don't tend to sell EA into new accounts, it tends to be into an existing account, expanding their MongoDB footprint, sellers do get compensated on EA. In part it goes back to the comment from the earlier question that our sales rep really can't dictate the IT deployment environment at a customer. And so yeah, they get paid on that. And to your comment about the sort of, EA results or expectations, that's really just as a result of the difficult compare, in part given that multi-year dynamic.",
  "Operator",
  "Thank you. One moment, please. Our next question comes from Alana Brent Bracelin of Piper Sandler. Your line is open.",
  "Brent Bracelin",
  "Good afternoon. Thank you. Michael, we're going to stick with the guide scene here. If I look at last year, you guided to, I think, 16% growth. You ended up doing 31% for the full year. Even if I take out the $80 million tailwind you talked about, that's still 25% growth. You're guiding to 14% growth this year, again 5% headwind, so closer to 19% organically. Are you more confident kind of going into this year than last year just as you think about the trends. Is the 14% comparable to the 16% initial guide last year? Is it really more like 19% adjusted basis comparing to 16%? I know it's a little confusing, but getting a lot of questions on it, thanks.",
  "Michael Gordon",
  "Yeah, no, it's fine. I go back to what I said in response to, I think it was Sanjitâ\u0080\u0099s question. There's been no fundamental change or approach in terms of how we're looking and determining our guidance. I do think to the confidence point, I think that that is correct. We do have more confidence. We have more data. We -- if you think back a year ago, as one of the questions indicated, there was much more macro uncertainty. I think over the course of fiscal â\u0080\u009824, we saw narrower variability. We saw more consistent results that does give us increased confidence. I think we also have another year under our belt in terms of understanding the seasonality trends of Atlas. I know Atlas is a big business, but it's still a relatively young one, especially when you think about getting quarterly data points. And so I think we have more confidence and better handle on that. And then lastly, while there is a difficult compare on EA, I think, we talked about this in the second half of last year where we were, at some point you could only be -- continue to be surprised by EA so much. And so as we looked at our, I think it was in our third quarter call, we talked about how we were upping our views on what EA could do. And so all that sort of baked into the guide.",
  "Brent Bracelin",
  "Helpful color there. And then just, Dev, as you think about the million dollar question, when do you think these AI tailwinds, the interest in Vector starts to really impact your business? It sounded like you think another -- we'll see another year of more experimentation before we see big production moves. Is that the right take? Just walk us through your current thinking on when AI really starts to show up in your business. Thanks.",
  "Dev Ittycheria",
  "Yeah, I think it's going to show up in a business when people are deploying AI apps at scale, right? So I think that's going to be at least another year. But that being said, we do see some really interesting startups who are building on top of MongoDB, so it gives us confidence about our platform fit for these sophisticated workloads. But, given all the noise around AI, you have to remember we're still in the very, very early days. The performance of some of these systems is, I would classify as okay, not great. The cost of inference is quite expensive, so people have to be quite careful about the types of applications they deploy. There's some debate about open versus closed source LLMs. Do they use case specific LLMs or more general purpose LLMs? So there's a lot of learnings going on. And obviously, there's an announcement today that yet another company had delivered better performance than GPT-4. So, people are -- there's a lot going on in this space. So, for people to really get comfortable in picking a stack and deploying workloads in mass is going to take a bit of time. There are obviously some outliers who are obviously being far more aggressive. But that's essentially what we see across our customer base. But the good news is that we feel like we're well positioned. We feel that people really resonate with a unified platform. One way to handle data, metadata and vector data, that we are open and composable, that we integrate to not only all the different LLMs, we integrate to different embedding models. And we also -- essentially also integrate with some of the emerging application frameworks that developers want to use. So we think we're well positioned and you'll see us continue to expand and broaden our reach in this category, but I do think it's going to take a little bit of time.",
  "Brent Bracelin",
  "Makes sense. Thank you.",
  "Operator",
  "Thank you. One moment, please. Our next question comes from the line of Karl [Technical Difficulty] of UBS. Your line is open.",
  "Unidentified Analyst",
  "Okay, great. Maybe one for Dev and one for Mike. Dev, just because my first question follows on that, I'll go to you first. There are certainly some voices in the industry that would argue that even in advance of AI applications being deployed at scale, which you just said might take a year, enterprises might look to spend more to modernize their existing data stack and on data readiness in advance of those AI apps going into production. Are you seeing any of that type of behavior that could proceed the in-production deployment timeframe?",
  "Dev Ittycheria",
  "Yeah, I touched a little bit about relational migrations. I mean, that's one way where a lot of people feel like they have a lot of data trapped in these legacy platforms. As we've shared, we've always had customers migrate from legacy SQL apps to MongoDB, But the hardest part was basically rewriting the application. Generative AI essentially lowers the cost to do so. We are running a bunch of pilots with customers. Customers are very aligned. We have access to senior level decision makers. And we're learning a lot. Obviously, we're learning about the effectiveness of some of these AI technologies. We're learning about how you have to handle old languages, old libraries, old packages, the different versions. And so the variability and all that makes it clear that this will require a mix of product and services. Product alone today will not solve the problem. So we do think this is a big opportunity, but we're in the early days. And as I said in the past, even when I talked to investors about this pre-AI, there was no big red easy button to press to kind of migrate a SQL app to MongoDB. And while GenAI makes that easier, it's still going to take a little bit of time, but it's definitely exciting and there's a lot of customers leaning in. And so, we're excited about the option, but it's a lot of work to do.",
  "Unidentified Analyst",
  "Yeah. Okay. Thanks, Dev. And then for Mike. Mike, could you just because we're all trying to set up our models by quarter for fiscal â\u0080\u009825, is there any way to be more descriptive about how that $80 million, the sum of those two pieces, tracked by quarter and in particular how much of the $80 million landed in the fourth quarter you just reported?",
  "Michael Gordon",
  "Yeah, so I don't have a quarterly breakdown. I guess what I would offer is throughout our life as a public company, including over the three prior quarters of this year, when there have been unusual trends, we've tried to call them out, so that people could understand both what was driving the results and looking forward what would impact the compares. And so, I think our historic comments should sort of leave a pretty good bread-cum-trail relative to things. I think we've been very clear on the multi-year deals and the EA outperformance when that's happened. And if you needed sort of a rule of thumb, credits would typically -- unused credits or unused commitments would typically, they map to the renewal cycle and we've called out the very seasonality as it relates to that. So those would probably be the big things on the EA and other non-Atlas, obviously Q2 last year was a big quarter. We talked about Alibaba and other deals that hit in Q2. And so I think you can -- it's not -- I wouldn't just divide by four. There are some differences quarter to quarter. And then lastly, we did call out the -- for folks who look at the business on a sequential basis, the impact of Atlas on the Atlas numbers for Q1, given that there'll be a much more pronounced effect, given this is the first quarter where we'll see the impact of that change.",
  "Unidentified Analyst",
  "Okay, awesome. Thanks a lot.",
  "Operator",
  "[Technical Difficulty]",
  "Unidentified Analyst",
  "Hello, Can you guys -- can you hear me? Because the line's cutting out a bit.",
  "Dev Ittycheria",
  "Yes, we can hear you. Unfortunately, we can't hear the moderator, but we can hear you.",
  "Unidentified Analyst",
  "Terrific. Okay, well, thank you for having me on. I'd like to ask about Atlas Stream Processing. So that was announced in June 2023. I guess, can you just remind us of like what is Mongo's reason to win in that segment of the market and then any idea of when that product will likely go GA?",
  "Dev Ittycheria",
  "Yes, so we announced -- as you said, we announced the private preview of Stream Processing where we ended up having hundreds of development teams use the product. Now we're in a public preview, so if customers are interested, they can actually start using the product today. Why are we in a position to win? For a couple reasons. One, this is purely focused on the developer market. The data is mainly in JSON. It requires a flexible schema and is for real-time applications. Given all those things are kind of coordinating, we feel really well positioned because most of the alternatives have a very rigid or fixed schema. And with the variability of data coming from these kind of events, that becomes much more problematic for customers to manage. So we feel very good about our position there. In terms of timing of when we're going to go GA, we're just currently getting feedback and responding to feedback. And we want to be very sure that we've addressed kind of the low-hanging fruit before we go generally available, but we're really sexcited about the opportunity that stream processing offers us.",
  "Unidentified Analyst",
  "Yeah, ideal. I might just also follow on to that and then add in my kind of proper second question. The follow-on is, is Stream Processing embedded in the guidance for fiscal â\u0080\u009825? And then the question I had is about the bottom line. The guidance, if I'm not mistaken, is a 10% op margins in fiscal â\u0080\u009825. Assuming the same beat as you guys did this year, so if 6 points of beat would put us at about 16 points of op margin exiting fiscal â\u0080\u009825, so kind of net-net flat year-on-year. Is that due to this kind of putting the kind of foot on the gas in terms of hiring and really trying to be aggressive at adding headcount? Thank you.",
  "Michael Gordon",
  "Yeah, so a couple different questions there. Let me try and get them all. So obviously our plans related to Stream Processing are included in our guidance, but we donâ\u0080\u0099t -- most of that will show up in Atlas overall when you think about the results. And certainly, whether it's new workloads or anything else, they tend to start off small and grow quickly in those first couple of quarters. But I wouldn't think of it as a major needle mover in the context of the fiscal â\u0080\u009825 results, but we're very excited about it over the long term. In terms of the op margin, yes, our guidance is to go backwards on operating margin relative to fiscal â\u0080\u009824. It will result in 500 basis points improvement over the two-year basis. And the thinking and the rationale related to that is the fact that if you take a step back and you look at us relative to the IPO, we had mapped out needing around 55 points of margin improvement to get to our target margins. With the fiscal â\u0080\u009824 results, we effectively delivered 50 of those 55 points and yet are still at 2% market share and so it makes sense to continue investing in the opportunity, particularly on the sales productive capacity as we talked about but also to execute against the product roadmap. And so we will continue to do that, and that will take us backwards relative to last year, but positive 500 basis points on the two-year basis.",
  "Unidentified Analyst",
  "Tremendous. Thank you so much.",
  "Operator",
  "Thank you. One moment, please. Our next question comes to the line of Brad Sills of Bank of America. Your line is open.",
  "Brad Sills",
  "Great. Thank you so much. I wanted to ask a question around the sales capacity. It sounds like, at some point last year, you realized that you had under-invested, maybe pivoted too much towards margin expansion and then are now catching up. In the guidance, if you could assume you had the sales capacity that you would prefer to be at this point, given the demand that you're seeing, would we be at a higher level of growth? I'm just trying to parse out how much of the guide is factoring in those constraints on sales capacity that you've talked about?",
  "Dev Ittycheria",
  "Yeah, so thanks for your question. Yes, we, given the macro uncertainty, especially coming out off Q4 of last year, we did slow down hiring quite meaningfully. And obviously that showed up in our numbers to the point that Michael talked about in our op margin as well. We obviously know that we have a big opportunity in front of us. So we are growing our headcount between the mid and high teens. We think that's appropriate relative to the opportunities we see. And yes, if we had more productive sales capacity, the guidance would probably be higher. There's no question about that.",
  "Michael Gordon",
  "Yeah, I would just -- Brad, I would just make sure it's clear. The slowing down and hiring was really macro related and just sort of concerns about the environment. If you think back then, there were broadscale layoffs happening across the industry and everything else. And obviously we successfully weathered the storm. I think we talked about on the last call how with the benefit of hindsight and the results that we put up and how quickly, at least for us, things stabilized, we could have started investing sooner. And so I think in the call -- the year-ago call, we talked about adding single digit headcount growth relative to I think 30% headcount growth in the prior year. We wound up adding 9%. So obviously at the high end of what would constitute single digits in part because of the stabilization that we did see, but to the comments that affect the op income guide and everything else, that was very back-end loaded, right? So those investments will much more affect the fiscal â\u0080\u009825 P&L, and that's really what we're reflecting into.",
  "Brad Sills",
  "Understood, thanks so much for that. And then one more, if I may please. You guys have such broad exposure to different industries. With the advent of AI coming into your business and some of the early progress you're seeing, are there any verticals that you would point to where you're seeing more activity perhaps than others, any use cases you might point to, just to give us a sense for where that early adopter might come from? Thank you.",
  "Dev Ittycheria",
  "Yeah, in regards to use cases, we're seeing most customers focus on driving efficiencies in their business because their existing baseline of costs are well known. So it's much easier for them to determine how much value they can derive by using some of these new AI technologies. So I see the first wave of applications being around reducing costs. You've seen some announcements by some customers saying, focusing on things like customer support and customer service, they really have -- they have found ways to dramatically reduce their costs. That's not surprising to me. I think cogeneration and this increasing developer productivity is another area. I think those are going to be kind of two areas where there's low hanging fruit. But then I think you're going to see customers focus on delivering better experiences for their customers and then find new streams of growth. And so I think it will be common phases. And so in terms of across industries, I think it's obviously there's some constraints and some customers based on the regulated nature of their industry, but in general we see basically high interest across almost every industry that we operate in.",
  "Brad Sills",
  "That's exciting. Thank you so much, Dev.",
  "Dev Ittycheria",
  "Thank you.",
  "Operator",
  "Thank you, Brad. Give me a moment. Our next question comes from the line of Rishi Jaluria of RBC. [Technical Difficulty] is open.",
  "Rishi Jaluria",
  "Wonderful. Hey, Dev. Hey, Michael. Thanks so much for taking my question. I wanted to first start with relational migrator. Dev, can you talk a little bit about what demand for that looks like? And when customers are talking to you, are they more focused around the value prop being around cost savings that they get from moving from legacy relational databases over to MongoDB? Is it more about the flexibility around the technology itself? And maybe if you could tie in, how you expect now with GenAI's accelerator, how that can impact the timeline of migrating workloads from relational over to MongoDB? And then I've got a quick follow-up to Michael.",
  "Dev Ittycheria",
  "Sure. When we talk to customers, and remember, even at our IPO, we had a meaningful number of customers migrating off relational to MongoDB. So they tend to come in three categories of reasons why. First is that the data models become so brittle with the relational architecture that it's very hard to build new features and be responsive to their customers. And so they just feel like their ability to innovate has slowed down. The second reason is that the system is just not scaling or performing given the increased number of users or the large amount of data that they have to process, that they realize that they have to get off a legacy platform. And the third reason is just the cost of the underlying platform and relative to the ROI that application is providing. So typically falls in one of those three buckets. Sometimes customers may have all three or maybe two of the three that are driving that demand. And then there's typically some compelling event, maybe there's some milestones they want to hit, maybe there's a renewal coming up with the incumbent vendor that's driving them to potentially move off that vendor as quickly as possible. As I said, with relational migrator, there's three parts to it. There's mapping of the schema from a tabular, relational schema to a document-based schema in MongoDB. Then there's actually moving the data, mapping to the new schema, and then there's the rewriting of the application. And so we have done lots of those already pre-GenAI, and some customers take a -- I want to rewrite everything. Some customers take a, I'll do it on a microservices basis, where I'll start peeling off functionality of the existing application and move that functionality to the new application and do that over time. It really depends on the customer's use case and their business needs. And yes, with GenAI, we do expect that rewriting the application has become easier and hence lower the cost of essentially switching, which by definition then expands the amount of customers and workloads you can go after. The other, I would say, on top of the three reasons I gave you in terms of why people move, there's now an emerging fourth reason, which is enabling their data and their applications to be more AI enabled. And so it's not just moving to more modern platform, but making them more AI enabled. And so that's also something that's getting customers' interest. And to your question on timing, as I said, I think this year we're going to see a lot of pilots and people trying out these new AI capabilities. And I think as the technology improves, as we learn more, I think you're going to see that scale much more quickly after that.",
  "Rishi Jaluria",
  "Wonderful. Really helpful. And then, Michael, just quickly, you put up your first free cash flow positive year in public company history. Just as we think about the margin guidance for next year, how should we be thinking about cash conversion going forward? Thanks.",
  "Michael Gordon",
  "Yeah, so I think the two factors to think about in terms of cash conversion are, within Atlas, there's this dynamic where we are reducing and continuing to see less upfront Atlas. Obviously, we're hitting the anniversary of that, and that's what's creating the headwind on the revenue front and the tough compare. But that's with Atlas at 68% of revenue. And so if you assume that Atlas is going to increase as a percent of revenue, I think that will sort of further drive the divergence. And then the only other big delta is things related to SBC and stuff like that. But I think it's the Atlas dynamic when you think about potential changes from a cash conversion standpoint, I think is where I'd focus and the impact, if you assume that Atlas is going to be a larger percent of the business.",
  "Rishi Jaluria",
  "All right, very helpful. Thank you, guys.",
  "Operator",
  "Thank you. [Technical Difficulty] comes from the line of Tyler Radke of Citi. Your line is open.",
  "Tyler Radke",
  "Hey, can you hear me okay?",
  "Dev Ittycheria",
  "Yeah. Hey, Tyler. Good evening.",
  "Tyler Radke",
  "Okay. Cool. Okay, sorry, the line was a little choppy. Dev, I wanted to ask you just a question as it relates to competition. Obviously, it's been a busy week at both Snowflake and Databricks with Frank Slootman retiring. I hope you're not going anywhere soon. But Databricks announcing pretty impressive growth. I guess, how do you think about your positioning relative to those two vendors, especially with the new CEO, kind of more of a technical focus at Snowflake, and new store product coming out later this year, do you expect to compete more, just frame for us how you're thinking about it, especially as the GenAI momentum increases over the coming years?",
  "Dev Ittycheria",
  "Yeah, so first of all, I'm very committed to MongoDB. I'm very excited about the opportunity here, so I have no plans to go anywhere. Second, in regards to Snowflake and Databricks, we don't typically compete with them, right? Because they're focused on analytical workloads. We're focused on operational workloads. So those are two very different sets of use cases. The big difference in terms of how customer buy, typically data warehouses and data lakes tends to be a centralized decision, organizations standardize on one platform, and then basically move their existing data to those platforms where I would say, operational platforms tend to be a more decentralized decision where different development teams, different lines of businesses, et cetera, based on the requirements for their application, will choose, will make their own independent decisions about what they think they need to do. And we've always talked about how we start with one team and then try and expand from there, and why there's so much focus on expanding within accounts and becoming a standard within an account, because then that accelerates the amount of workloads we capture. But those are two very different kind of customer buying behaviors in terms of analytical versus operational. With regards to the potential overlap, we are embedding more analytics capabilities. We have a very sophisticated aggregation framework, so people can do real-time processing of analytics on our platform with real-time data. Remember, data lakes and data warehouses have a batch process to get that data into their platforms, so they're not dealing with the real-time data. And then with regards to Unistore, listen, there's like over 300 databases in the marketplace, so not sure, I have a lot of respect for the Snowflake people. I'm not sure, we've heard noises about Unistore for a long time, but we feel very comfortable and confident about our position just given the investments we made on our platform and the large customers we have. And frankly, the popularity of our platform with developers. And remember, developers are not a persona that these other players typically go after. They go after more the analysts and the data scientist community. We're very, very focused on developers.",
  "Tyler Radke",
  "That's helpful. Michael, just a quick follow-up for you on the overage comments you made. I guess a couple questions. First of all, the $40 million is what I think you called out. That seems pretty high for last year, just considering we hadn't really heard about it, since Q4 of last year, we called out only several million of overage credit figures. Can you just frame for us, was that consistent with what you've seen in prior years? And I guess, you're obviously embedding that that doesn't continue next year. Is that a change in the way that you're recognizing overage revenue or is that just -- you don't expect that to happen because all your contracts have been reset? Thank you.",
  "Michael Gordon",
  "Yeah, so just two quick things in the interest of time. So a reminder, the several was the incremental amount over and above the normal amount that we experienced. So that's the sort of the principle that we take where we try and call out differences or variations from sort of the normal behavior. And so it was several million more than what we would normally see. The $40 million is the amount that was recognized in fiscal â\u0080\u009824. We do see that going to zero effectively. And you're right, that's directly as a result of the changes that we've made in the go-to market and the fact that we are not prioritizing commitments and haven't since the start of last fiscal year. And so the result of that is that you have many fewer commitments and unused -- the revenue for unused credits simply just reflects the revenue at the end of that contract period that you haven't realized or recognized through consumption. And so we expect that to go away because we've taken a different approach to the market to drive greater adoption of workloads and all the other things that we've talked about, which is the rationale for doing that in the first place. So hopefully that helps put all that in context.",
  "Tyler Radke",
  "It does. Thank you.",
  "Operator",
  "Thank you. That does conclude our conference for today. I'd like to turn the call back over to Dev, CEO, for any closing remarks.",
  "Dev Ittycheria",
  "Thank you. Again, I thank everyone for joining us today. I just want to reiterate that we had a strong quarter and year as we executed our opportunity. We do expect fiscal â\u0080\u009825 to play out similarly to fiscal â\u0080\u009824 with a healthy new business and stable consumption trends. We are very excited about the long-term AI opportunity, but still believe it's early days as customers are mainly in the experimentation and prototyping stages of building AI applications. And our priorities for fiscal â\u0080\u009825 are to invest in deepening our product advantage while remaining focused on acquiring new workloads and establishing ourselves as the standard for building modern applications. So thank you again for joining us and we'll talk to you soon. Take care. Bye-bye.",
  "Operator",
  "Thank you. Ladies and gentlemen, this does conclude today's conference. Thank you all for participating. You may now disconnect. Have a great day."
]