[
  "MongoDB, Inc. (NASDAQ:MDB) Q2 2024 Earnings Call Transcript August 31, 2023 5:00 PM ET",
  "Company Participants",
  "Brian Denyeau - IR, ICR Dev Ittycheria - President and CEO Michael Gordon - COO and CFO",
  "Conference Call Participants",
  "Raimo Lenschow - Barclays Keith Weiss - Morgan Stanley Kash Rangan - Goldman Sachs Brad Reback - Stifel Karl Keirstead - UBS Brent Bracelin - Piper Sandler Jason Ader - William Blair Tyler Radke - Citi Patrick Walravens - JMP Securities Michael Turits - KeyBanc Mike Cikos - Needham",
  "Operator",
  "Good day, and thank you for standing by. Welcome to the MongoDB Second Quarter Fiscal Year 2024 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator Instructions] Please be advised that today's conference is being recorded.",
  "I would now like to turn the conference over to your speaker for today, Mr. Brian Denyeau. Please go ahead, sir. The floor is yours.",
  "Brian Denyeau",
  "Thank you, Lisa. Good afternoon, and thank you for joining us today to review MongoDB's second quarter fiscal 2024 financial results, which we announced in our press release issued after the close of market today. Joining me on the call today are Dev Ittycheria, President and CEO of MongoDB, and Michael Gordon, MongoDB's COO and CFO.",
  "During this call, we will make forward-looking statements, including statements related to our market and our future growth opportunities, the benefits of our product platform, our competitive landscape, customer behaviors, our financial guidance, and our planned investments. These statements are subject to a variety of risks and uncertainties, including the results of operations and financial conditions that could cause actual results to differ materially from our expectations.",
  "For a discussion of the material risks and uncertainties that could affect our actual results, please refer to the risks described in our quarterly report on Form 10-Q for the quarter ended April 30, 2023, filed with the SEC on June 2, 2023. Any forward-looking statements made on this call reflect our views only as of today and we undertake no obligation to update them except as required by law.",
  "Additionally, we will discuss non-GAAP financial measures on this conference call. Please refer to the tables in our earnings release on the Investor Relations portion of our website for a reconciliation of these measures to the most directly comparable GAAP financial measure.",
  "With that, I'd like to turn the call over to Dev.",
  "Dev Ittycheria",
  "Thank you, Brian, and thank you to everyone for joining us today. I am pleased to report that we had another exceptional quarter as we continue to execute well despite challenging market conditions. I will start by reviewing our second-quarter results before giving you a broader company update. We generated revenue of $424 million, a 40% year-over-year increase and above the high end of our guidance.",
  "Atlas revenue grew 38% year-over-year, representing 63% of revenue, and is now a $1 billion-plus revenue run-rate product. We generated a non-GAAP operating margin -- operating income of $79 million for a record 19% non-GAAP operating margin, and we had another solid quarter of customer growth, ending the quarter with over 45,000 customers. Overall, we delivered an exceptional Q2.",
  "We had a healthy quarter of new business acquisitions, led by continued strength in new workload acquisition within our existing customers. From a new logo perspective, we added 1,900 new customers in the quarter. Our direct sales team had another strong quarter of Enterprise customer additions. Finally, our Enterprise Advanced and other non-Atlas business significantly exceeded our expectations, another indication of our strong product market fit and the appeal of our run anywhere strategy.",
  "Moving on to Atlas consumption trends, the quarter played out slightly better than our expectations. Michael will discuss consumption trends in more detail. Finally, retention rates remained strong in Q2, reinforcing the mission criticality of our platform, even in a difficult spending environment. As we've told you in the past, our market is different from most other software markets because the unit of competition is a workload, not a customer. We started customer relationships by acquiring the first workload and we grew from there acquiring incremental workloads over time. Over the last few years, we have oriented our entire company around winning more workloads.",
  "Starting with product. At our New York user conference held in June, we made a number of product announcements that will position us to capture more workloads faster. We introduced Atlas Stream Processing, which enables developers to work with streaming data to build sophisticated event-driven applications, the flexibility of the document model and the power of the MongoDB Query Language provide a compelling and differentiated way to process streaming data compared to alternative approaches. Our early access program is meaningfully been oversubscribed as customers realize they can use a familiar and easy approach to work with streaming data and immediately see value.",
  "We announced the general availability of Relational Migrator, which makes it easier for customers to migrate their existing relational applications to MongoDB. We are seeing increased adoption across industries and geographies. For example, a leading international retailer was able to leverage Relational Migrator to dramatically accelerate their migration of Oracle.",
  "We also announced Atlas Vector Search, which enables developers to store, index, and query vector embeddings instead of having to bolt-on vector search functionality separately adding yet another point solution and creating a more fragmented developer experience, developers can aggregate and process the vectorized data they need to build AI applications, while also using MongoDB to aggregate and process data and metadata. We're seeing significant interest in our Vector Search offering from large and sophisticated enterprise customers, even though it's only -- still only in preview. As one example, a large global management consulting firm is using Atlas -- Atlas Vector Search for internal research applications that allows consultants to semantically search over 1.5 million expert interview transcripts.",
  "Over time, AI functionality will make developers more productive to the use of code generation and code assist tools that enable them to build more applications faster. Developers will also be able to enrich applications with compelling AI experiences by enabling integration with either proprietary or open-source, large language models to deliver more impact.",
  "Now instead of data being used only by data scientists to drive insights, data can be used by developers to build smarter applications that truly transform the business. These AI applications will be exceptionally demanding, requiring a truly modern operational data platform like MongoDB. In fact, we believe MongoDB has an even stronger competitive advantage in the world of AI.",
  "First, the document model's inherent flexibility and versatility renders it a natural fit for AI applications. Developers can easily manage and process various data types all in one place. Second, AI applications require high-performance, parallel computations, and the ability to scale data processing on an ever-growing base of data. MongoDB supports its features with features like sharding and auto-scaling. Lastly, it is important to remember that AI applications have the same demand as any other type of application, transactional guarantees, security and privacy requirements, tech search, in-app analytics, and more.",
  "Our developer data platform gives developer a unified solution to build smarter AI applications. We are seeing these applications developed across a wide variety of customer types and use cases. For example, Observe.AI is an AI startup that leverages 40 billion parameter LLM to provide customers with intelligence and coaching that maximize performance of their frontline support and sales teams. Observe.AI processes and run models on millions of support touchpoints daily to generate insights for the customers.",
  "Most of this rich unstructured data is stored in MongoDB. Observe.AI chose to build on MongoDB, because we enabled them to quickly innovate, scale to handle large and unpredictable workloads and meet the security requirements of their largest enterprise customers. On the other end of the spectrum is one of the leading industrial equipment suppliers in North America. This company relies on Atlas and Atlas Device Sync to deploy AI models at the edge. To their field teams, mobile devices to better manage and predict inventory in areas with poor physical network connectivity, they chose MongoDB because of our ability to efficiently handle large quantities of distributed data and to seamlessly integrate between the network edge and their back-end systems.",
  "As much as we innovate our products, we also continuously innovate and how we engage with our customers. We are highly focused on reducing friction in the sales process, so we can acquire more workloads quickly and cost-effectively given the large size of our market opportunity. Historically, the most significant source of friction has been negotiating with customers to secure an upfront Atlas commitment since it can be hard for customers to forecast consumption growth for a new workload. Given our high retention rates and the underlying consumption growth, several years ago, we began reducing the importance of upfront commitments in our go-to-market process to accelerate workload acquisition.",
  "This year, we took additional steps in that direction. For example, we no longer incentivize reps to sign customers to one-year commitments. Obviously, this has short-term impacts on our cash flow, but positions us better for the longer term by accelerating workload acquisition. We are pleased with the impact these changes have had on the business in the first half of the year, specifically, new workload acquisition has accelerated, especially within existing customers. We believe that our efforts to reduce friction are resulting in more efficient growth and we'll always look for ways to improve our go-to-market approach to make it even easier for customers to bring new workloads onto our platform.",
  "Now, I'd like to spend a few minutes reviewing the adoption trends of MongoDB across our customer base. Customers across industries, including Renault, Hootsuite, and Ford are running mission-critical projects on MongoDB Atlas, leveraging the full power of our developer data platform. One of the 2023 MongoDB North American Innovation Award winners is Ford. With a focus on innovation, quality, and customer satisfaction, Ford is a leader in the automotive industry and a household name around the world. Ford is committed to developing advanced technologies that enhance the safety, performance, and sustainability of its vehicles. Their data explorer and transportation mobility cloud applications aggregate customer vehicle data from 24 different sources at a volume ranging up to 15 terabytes. Since migrating to MongoDB Atlas from the previous solution, Ford has seen a 50% performance improvement and faster rewrite times.",
  "Cathay Pacific, Foot Locker, and Market Access are examples of customers turning to MongoDB to free up the developerâ\u0080\u0099s time for innovation while achieving significant cost savings. Cathay Pacific, Hong Kong's home airline carrier operating in more than 60 destinations worldwide, turned to MongoDB on their journey to become one of the first airlines to create a truly paperless flight deck.",
  "Flight Folder, their application built on MongoDB, consolidates dozens of different information sources into one place and includes a digital refueling feature that helps crews become much more efficient with fueling strategies, saving significant flight time and costs. Since the Flight Folder launch, Cathay Pacific has completed more than 340,000 flights with full digital integration in the flight deck.",
  "In addition to the greatly improved flight crew experience, flight times have been reduced and the digital refueling has saved eight minutes on the ground on average. All these efficiencies have helped the company avoid the release of 15,000 tons of carbon and save an estimated $12.5 million.",
  "Powerledger, Wells Fargo, and System1 are among customers turning to MongoDB to modernize existing applications. System1, a customer acquisition marketing company acquired MapQuest in 2019. At the time of the acquisition, MapQuest had a fragmented architecture that mixed disparate data persistent technologies with third-party services.",
  "System1 selected Atlas as a key piece of MapQuest's architecture transformation and has realized estimated cost reductions of 75% and performance improvements of 20% over its prior relational database solution. MapQuest is planning a number of future projects that we use Atlas search and time series collections to improve the user experience and create a feedback loop and location-based relevancy in different cities.",
  "In summary, I am incredibly stoked with our second-quarter results. Our ability to win new workloads remained strong and our run anywhere strategy is resonating with customers. While it's early days on AI, we continue to see evidence that MongoDB will be a platform of choice for AI applications, just like we are for other modern and demanding applications. We continue to invest to maximize our long-term potential.",
  "With that, here's Michael.",
  "Michael Gordon",
  "Thanks, Dev. As mentioned, we delivered a strong performance in the second quarter, both financially and operationally. I'll begin with a detailed review of our second quarter results and then finish with our outlook for the third quarter and full fiscal year 2024. First, I'll start with our second quarter results.",
  "Total revenue in the quarter was $423.8 million, up 40% year-over-year. As Dev mentioned, we continue to see a healthy new business environment especially in terms of acquiring new workloads within existing customers. To us, this is confirmation we remain a top priority for our customers and that our value proposition continues to resonate even in this market.",
  "Shifting to our product mix, let's start with Atlas. Atlas grew 38% in the quarter compared to the previous year and represents 63% of total revenue compared to 64% in the second quarter of fiscal 2023 and 65% last quarter. In Q2, Atlas slightly declined as a percentage of revenue due to the exceptionally strong performance of our non-Atlas business, underscoring the demand for MongoDB regardless of where customers are in their cloud adoption journey. As a reminder, we recognize Atlas revenue primarily based on customer consumption of our platform and that consumption is closely related to end-user activity of the application, which can be affected by macroeconomic factors.",
  "Let me provide some context on Atlas consumption in the quarter. Consumption growth in Q2 was slightly better than our expectations. As a reminder, we had assumed Atlas would continue to be impacted by the difficult macro environment in Q2, and that is largely how the quarter played out.",
  "Turning to non-Atlas revenues. EA significantly exceeded our expectations in the quarter, and we continue to have success selling incremental workloads into our EA customer base. We continue to see that our customers, regardless of their mode of deployment, are launching more workloads at MongoDB and moving towards standardizing on our platform. The EA revenue outperformance was in part a result of more multiyear deals than we had expected. In addition, we had an exceptionally strong quarter in our other licensing revenues.",
  "On our last call, we mentioned that we would benefit from a few large multiyear licensing deals, most notably the renewal and extension of our relationship with Alibaba. We also closed some additional multiyear licensing deals in the quarter, which is a meaningful contributor to our outperformance and another sign of popularity of MongoDB and the success of our run anywhere strategy. As a reminder, under ASC 606 for both EA and licensing contracts, the term license component even for multiyear deals, is recognized as upfront revenue.",
  "Turning to customer growth. During the second quarter, we grew our customer base by approximately 1,900 customers sequentially, bringing our total customer count to over 45,000, which is up from over 37,000 in the year period. Of our total customer count, over 6,800 are direct sales customers, which compares to over 5,400 in the year ago period. The growth in our total customer count is being driven primarily by Atlas, which had over 43,500 customers at the end of the quarter compared to over 35,500 in the year ago period. It's important to keep in mind that the growth in our Atlas customer count reflects new customers to MongoDB in addition to existing EA customers, adding incremental Atlas workloads.",
  "Let me double-click into our direct customer count. As Dev mentioned, we're becoming increasingly sophisticated in how we engage our customers. But some of those motions result in the line between our direct sales and our self-service channels becoming more fluid. I thought it'd be helpful to highlight two particular inter-channel dynamics that impact the channel breakdown of our reported customer counts. While these customer movements represent less than 1% of our ARR, we do expect both of these trends to continue into the future, and so we wanted to make sure you understood how they affect our reported customer counts by channel.",
  "First, we are having increasing success leveraging cloud provider self-service marketplaces to drive new customer additions. Growing cloud marketplace volumes is a major secular trend, and we are the only ISV available on all three hyperscaler marketplaces. Customers can deploy Atlas in seconds through cloud provider consoles and can pay for it by drawing down their existing cloud commitments. This further reduces friction as it bypasses the need for our contract altogether. For this reason, our direct sales team has been directing certain new prospects to sign-up using self-serve marketplaces. We've added several hundred customers using this approach in recent quarters, and these customers show up in our self-serve customer count even though we have a direct sales relationship with them.",
  "Second, we continually review and analyze product usage signals to determine the potential of our customers. Because we are focused on velocity and efficiency of new workload acquisition, we're very careful not to deploy our reps on accounts where we don't see significant incremental benefit from sales rep coverage. If we determine that a direct sales customer can be supported more cost effectively in the self-serve channel, we'd prefer to free up the rep's time to focus on winning more new workloads. So far this year, we've moved over 300 small mid-market direct sales customers to the self-service channel.",
  "Moving on to ARR. We had another quarter with our net ARR expansion rate above 120%. We ended the quarter with 1,855 customers with at least $100,000 in ARR and annualized MRR, which is up from 1,462 in the year ago period.",
  "Moving down the income statement. I'll be discussing our results on a non-GAAP basis unless otherwise noted. Gross profit in the second quarter was $329 million, representing a gross margin of 78%, which is up from 73% in the year ago period. It is important to keep in mind that this quarter, we saw exceptional performance of our EA and licensing revenue, which contains a large upfront license component and very high margins, and therefore, we wouldn't expect to repeat this performance.",
  "Our income from operations was $79.1 million or a 19% operating margin for the second quarter compared to a negative 4% margin in the year ago period. Our strong bottom-line results demonstrate the significant operating leverage in our model and are a clear indication of the strength in our underlying unit economics. The primary reason for our operating income results versus guidance is our revenue outperformance.",
  "Net income in the second quarter was $76.7 million or $0.93 per share based on 82.5 million diluted weighted average shares outstanding. This compares to a net loss of $15.6 million or $0.23 per share on 68.3 million base weighted average shares outstanding in the year ago period.",
  "Turning to the balance sheet and cash flow. We ended the second quarter with $1.9 billion in cash, cash equivalents, short-term investments and restricted cash. Operating cash flow in the second quarter was negative $25.3 million. After taking into consideration approximately $2 million in capital expenditures and principal repayments of finance lease liabilities, free cash flow was negative $27.3 million in the quarter. This compares to negative free cash flow of $48.6 million in the second quarter of fiscal 2023.",
  "Three things of note on our cash flow performance in the quarter. First, as many of you know, Q2 tends to be our seasonally lowest collections quarter of the year because of low contract volumes in Q1, as evidenced by our Q1 ending accounts receivable balance. Second, while our revenue reflects the ASC 606 treatment of multiyear EA and licensing deals, most multiyear contracts are still billed annually, so there's no equivalent benefit to cash flow. Finally, as Dev mentioned, we continue de-emphasizing the value of upfront commitments. So we're seeing fewer of them. In other words, we are intentionally collecting less cash upfront in order to win more workloads more quickly. As evidence of this, we grew Atlas revenue 38% year-over-year, while Atlas dollars committed upfront actually declined by 15% year-over-year. Lower upfront commitments only impact the timing of when our customers pay us, not the total payment. But this trend of declining upfront commitments will impact the relationship between our non-GAAP operating income and operating cash flow in the medium term.",
  "I'd now like to turn to our outlook for the third quarter and full fiscal year 2024. For the third quarter, we expect revenue to be in the range of $400 million to $404 million, we expect non-GAAP income from moderations to be in the range of $41 million to $44 million and non-GAAP net income per share to be in the range of $0.47 to $0.50 based on 83.5 million estimated diluted weighted average shares outstanding.",
  "For the full fiscal year '24, we expect revenue to be in the range of $1.596 billion to $1.608 billion. For the full fiscal year 2024, we expect non-GAAP income from operations to be in the range of $189 million to $197 million and non-GAAP net income per share to be in the range of $2.27 and to $2.35 based on 83 million estimated diluted weighted average shares outstanding. Note that the non-GAAP net income per share guidance for the third quarter and full fiscal year 2024 includes a non-GAAP tax provision of approximately 20%.",
  "I'll provide some more context on our guidance. First, we have modestly raised our outlook for the rest of the year, primarily to reflect a slightly stronger Q2 and therefore a higher starting ARR for the second half. We continue to expect that Atlas consumption growth will be impacted by the difficult macroeconomic environment throughout fiscal '24. Our revised full year revenue guidance continues to assume consumption growth that is, on average, in line with the consumption growth we've experienced in the slowdown began in Q2 of last year, but with a slight seasonal benefit in Q3 and a slowdown in Q4 as observed over the last two years.",
  "Second, we expect to see a significant sequential decline in non-Atlas revenues in Q3 as we simply do expect similar new business activity, especially when it comes to licensing deals. For that particular line of business, Q2 was just an extreme positive outlier.",
  "Third, we're raising our non-Atlas revenue estimate for the rest of the year, even though we don't expect our exceptional Q2 performance to repeat in the second half, our results in the first half give us incremental confidence in our run anywhere strategy. We continue to expect, however, that the difficult compare in the back half of the year will impact our non-Atlas growth rate.",
  "Finally, thanks to strong performance in Q2 and the increased revenue outlook, we're meaningfully increasing our assumption for operating margins in fiscal '24 to 12% at the midpoint of our guidance. an improvement of more than 700 basis points compared to fiscal '23, while continuing to invest to pursue our long-term opportunity. As you update your models, please keep in mind that the majority of our planned fiscal '24 hiring will actually occur in the second half of the year.",
  "To summarize, MongoDB delivered excellent second quarter results in a difficult environment. We are pleased with our ability to win new business and are demonstrating the operating leverage inherent in our model. While we continue to monitor the macro environment, we remain incredibly excited about the opportunity ahead [Technical Difficulty] to maximize our long-term value.",
  "With that, we'd like to open it up to questions. Operator?",
  "Question-and-Answer Session",
  "Operator",
  "Thank you. [Operator Instructions]. One moment while we can file the Q&A roster. And our first question today will be coming from Raimo Lenschow of Barclays. Your line is open.",
  "Raimo Lenschow",
  "Thank you. Good new version. Congrats from me on a great quarter. Two quick questions. First, the new -- or the trends you saw for EA or the numbers you saw for EA this quarter, you called out kind of bigger commitments from existing customers and taking more workloads -- or returning more workloads towards Mongo. Is that -- could you talk a little bit towards that in terms of is that a new trend? Was it just kind of very special this quarter? What are you seeing there? Because that's kind of in this sort of environment, seems like against what do you see from everyone else. So maybe couple of factors there? And then the second question is on the newer products like the streaming and vector databases, how does that feed into the revenue model for Mongo? Thatâ\u0080\u0099s it for me. Thank you.",
  "Dev Ittycheria",
  "Sure. So Raimo, the trends for EA, I think, is just an indication of our run anywhere strategy. We've been very committed to that strategy since the beginning. As you know, we started with EA and then introduced Atlas. But the whole point is that we give customers choice and we want to meet customers where they are in terms of what deployment model they want to use. And so I think this is just puts and takes of the quarter where we had a number of customers who wanted to double down on EA. And we also had some other non-Atlas business come in, in the quarter, which showed up in our results. But it's really a confirmation of the fact that we give customers choice and customers really appreciate that, and that's what you've seen in the results. With regards to, I think you said streaming and vector, those will show up in the Atlas revenue line as incremental consumption. There won't be a separate SKU. But what it will do is drive, as those workloads come on, that will drive incremental consumption of Atlas, which will show up in the Atlas revenue line.",
  "Michael Gordon",
  "Yes. I would just add that also as part of the broader developer data platform, it gives us the opportunity to win more workloads in the beginning. So you've got both sort of new workload penetration piece, which Dev mentioned, but also sort of the increased Atlas number is where it will show up on a revenue standpoint.",
  "Raimo Lenschow",
  "Okay. Perfect. Thank you, congrats.",
  "Michael Gordon",
  "Thank you.",
  "Dev Ittycheria",
  "Thanks, Raimo.",
  "Operator",
  "Thank you. One moment for our next question. And our next question will be coming from Keith Weiss of Morgan Stanley. Your line is open.",
  "Keith Weiss",
  "This is Keith Weiss on for Sanjit Singh. One question for Dev and one for Michael. Dev, you guys talked about, I think, last quarter, 1,500 AI companies using MongoDB. You talked a lot about your applicability for AI workloads. I think a question that a lot of investors have is like the time frame for when this actually creates real impacts to where it becomes significant tailwind or just software in general, but more specifically the question to you is when do you think that becomes a significant tailwind for MongoDB? When will we see that more significantly in Atlas revenues? And then the question for Michael. We talked about the commitments coming down, the Atlas commitments coming down and that being a drag on operating cash flow. Any sense you could give us on how long that drag on [OCF] (ph) persists? Is there any way to size that impact over time?",
  "Dev Ittycheria",
  "So, Keith, on AI, obviously, we're really excited about the opportunity that AI presents. We continue to add many more AI customers this quarter. In the short term, we're really excited about some of the use cases we're seeing. We talked about Observe.Ai, the management consulting company, a more traditional company using MongoDB for very impactful AI use case. And longer term, we believe our developer data platform value prop will just drive more AI adoption. People want to use one compelling, unified developer experience to address a wide variety of use cases of which AI is just one of them. And we're definitely hearing from customers to being able to do that on one platform versus bolting on a bunch of point solutions is far more the preferable approach. And so we're excited about the opportunity there.",
  "And I think you had some questions -- on the other thing on partners, I do want to say that we're seeing a lot of work and activity with our partner channel on the AI front as well. We're working with Google in the AI start-up program, and there's a lot of excitement. Google had their next conference this week. We're also working with Google to help train Codey, their code generation tool to help people accelerate the development of AI and other applications. And we're seeing a lot of interest in our own AI innovators program. We've had lots of customers apply for that program. So we're super excited about the interest that we're generating.",
  "Michael Gordon",
  "And on your other question, Keith, it's been a multiyear journey where we've been focused on reducing friction and accelerating new workload adoption. I do think as we called out, we continue to make additional steps and Dev called out some of the specific incremental steps this year. I think it's part of a transition. If you look at the Atlas revenue growth, Atlas grew 38% year-over-year, but dollars collected upfront shrank 15%, right? And so that gives you a sense for the magnitude or the divergence there that's showing up in the op income versus OCF bridge. I think like most things, there'll be a transition time period, but then it will settle into a more normalized level, but I think we've still got like a little bit more transition to go as we kind of work through the balance of the year.",
  "Keith Weiss",
  "Got it. Thank you, guys.",
  "Dev Ittycheria",
  "Thank you, Keith.",
  "Operator",
  "Thank you. One moment for our next question. And our next question will be coming from Kash Rangan of Goldman Sachs. Your line is open. Kash Rangan of Goldman Sachs, your line is open.",
  "Kash Rangan",
  "I'm sorry, I didn't hear my name. Thank you very much and congrats, Dev and Michael on the quarter. It's hard to -- put up this kind of operating margin performance being a database company at the scale that you're operating. So kudos on that. The relational migrator came off of beta and came into GA this quarter. So I wonder if that had any particular impact on the EA business because you've certainly up sighted your modest expectations. I want to get a little bit more detail on how that pipeline of Relational Migrator beta customers should play out? Is it going to be showing up in Atlas? Or is it going to be showing up in enterprise, the on-prem version.",
  "And on AI, just curious if you can quantify the level of consumption impact in the future to Atlas that you could attribute to the different new things that Mongo is working, whether it's AI or streaming. How should we think about the incremental opportunities for consumption afforded by some of the new things you launched at MongoDB live in New York a couple of months back. Thank you so much. Congrats.",
  "Dev Ittycheria",
  "Sure. So regarding relational migrators, it's important for investors to know that this is really a high-end enterprise play. That's where the bulk of the legacy relational market is. And Relational Migrator is designed to help customers reduce the switching cost of migrating off relational databases to MongoDB for both EA and Atlas. So it's a place to -- depending again on the customer's choice of their deployment model but it's really meant to reducing the switching costs. I would say that there was no real impact in terms of revenue of customers using Relational Migrator because we just only made it generally available in June. But there's a tremendous amount of excitement. We have a large pipeline of customers who are very interested and are actually starting to use Relational Migrator and projects have begun, but there was no real impact on the quarter.",
  "Regarding your second question about some of the new products and the impact of AI long term, what I would say is we definitely believe it will have a big impact long term. We think that things like Vector Search just make it so much easier to build smarter applications on MongoDB that unified developer experience is a key differentiator. There's a really strong interest in our Public Preview product. We also see a lot of interest in Stream Processing. Stream Processing is a use case that's really optimized for MongoDB. The data is typically JSON, the variability of the data lends itself to a document model that's much more flexible. It's obviously very developer-oriented, where all the alternatives are using very rigid schemas and are much more complicated to use that plays into our sweet spot. So we think we have a big opportunity there. But -- and so it's hard to quantify what that impact will be in the long term, but I will tell you that we're really excited and the interest level on the new products is incredibly high.",
  "Kash Rangan",
  "Fantastic. Thank you.",
  "Dev Ittycheria",
  "Thank you, Kash.",
  "Operator",
  "Thank you. One moment for the next question. Our next question will be coming from Brad Reback of Stifel. Your line is open.",
  "Brad Reback",
  "Great. Thanks very much. I'm not sure Dev or Michael, but going back to the commentary on fewer upfront Atlas commits. Oftentimes, when customers sign multiyear deals and pay upfront, they get a better rate. So if we were to think about not having them pay you upfront and make long-term commits, is that a net margin benefit to you guys on the pricing side?",
  "Michael Gordon",
  "Yeah. So a couple of things. Thanks, Brad, for the question. In general, for us, even before the sort of evolution and changes in multiyear deals, typically, they were not all paid upfront. Typically, ours has been annually billed. But yes, to your point, I think as we've reduced upfront commitment, you have a couple of dynamics. The key one is when we are not motivating it or providing an incentive to our sales force, and it winds up being customer driven, the leverage in that negotiation shifts. And on the margin, that is helpful for the ultimate pricing or discount and winds up with sort of better pricing for us, less discounting to the customer.",
  "Brad Reback",
  "Excellent. And then on your commentary about second half hiring outpacing first half. Would it be correct to assume that the hiring environment is a little less competitive, so you might actually be able to find people more easily and get better pricing for them as well? Thanks.",
  "Dev Ittycheria",
  "Yeah. What I would say, Brad, is that, I would say, in general, obviously, the frothiness of a few years ago has abated, but for certain skill sets, there's still significant premium for talent, and we don't want to lower our bar just to optimize on cost. We pride ourselves on recruiting the best of the best in this industry. And we focus on paying market rates. And so while it's a little easier because the market is a little softer, I wouldn't suggest that all of a sudden, we're getting employees at a massive discount.",
  "Michael Gordon",
  "Yeah. I would think about it as availability rather than cost and then throw in some of the dynamics with some places around different return to office models and other things. I think that sort of incrementally is likely to provide opportunities in the back half of the year. And as they present themselves, we'll certainly pursue those.",
  "Brad Reback",
  "Excellent. Thank you.",
  "Michael Gordon",
  "Thank you.",
  "Operator",
  "Thank you. One moment for the next question. Our next question will be coming from Karl Keirstead of UBS. Your line is open.",
  "Karl Keirstead",
  "Okay. Great. Maybe this one to Mike. Michael, I wouldn't normally ask about the other segment, but it's such an outlier if I could ask a two-parter. First is, what surprised on the upside there? Was the Alibaba deal much larger than you thought? Or did you grab a few others, maybe you could unpack that? And secondly, you did tell us that the second half guidance assumes a significant decline in the non-Atlas business. Is it fair to assume that this other category might return back to the levels it was at pre the July quarter? Thank you.",
  "Michael Gordon",
  "Yeah. Thanks, Karl. No, other deals, not Alibaba. Alibaba was baked at the time of the last guidance call. So it was sort of incremental deals that surprised us to the upside there. And yes, obviously, it's a volatile or variable, especially given the 606 and the nature of it where it goes, given the lumpiness of the term license revenue and things like that. And so, yes, I think that this is not repeatable performance, and I think it should settle back down to a more -- to a lower and more normalized level.",
  "Karl Keirstead",
  "Okay. And then if I could ask a follow-up, Mike, you did a good job explaining the changes in the model and the licensing on cash flow, but it's not a metric you often talk about, but your deferred revenue balance was actually down year-over-year, highly unusual. Is this basically the same explanation that would be impacting DR? Thank you.",
  "Michael Gordon",
  "Yeah. I think it's the same explanation or discussion overlaid with our recurring discussion around billings, and that's sort of not a metric that we focused on and that we sort of discourage people from using and we're focused sort of on those workloads and winning new workloads rather than large upfront commitments. But one of the ways that plays out is absolutely in deferred and for anyone still doing defer -- I mean, calculated billings. Calculations that will affect that there as well. Yes.",
  "Karl Keirstead",
  "Okay. Awesome. Thanks so much.",
  "Operator",
  "Thank you. One moment for the next question. Our next question is coming from Rishi Jaluria of RBC. Your line is open.",
  "Unidentified Analyst",
  "This is [Rich calling] (ph) on for Rishi Jaluria today. Thanks for taking my question. So I guess if we look at the workloads you have in front of you with Vector Search, Relational Migrator and Streaming and could even throw an application search, which was more of a driver, let's call it, last year. But if we had to stack rank each of those workloads in terms of your positioning to win and your overall opportunity in each of those use cases, how would you go about doing that?",
  "Dev Ittycheria",
  "Yeah. So Rich, thanks for your question. I would say, obviously, the general operational workload of what you call the OLTP workload is still our bread and butter. Workloads that people come to us and relational migrator would just be more of that because of the migrating operational workloads of relational databases to MongoDB. And then the other use case really, other products really function of the use cases that customers are really interested in. For example, Atlas Device Sync, which is really focused on the enterprise mobility play, for example, point-of-sale devices for the retail industry in automotive, connected car in manufacturing, instrumenting the factory floor. So it really depends on the use cases. In application search, we're really seeing an acceleration of large workloads in that -- for that product. So we're really excited about the size of some of the business that we're seeing there.",
  "Obviously, Vector is still in public preview. So we hope to have a GA sometime next year, but we're really excited about the early and high interest from enterprises. And obviously, some customers are already deploying it in production, even though it's a public preview product. Streaming is something that we're super excited about. This is more for event-driven real-time applications. It's just very suitable for MongoDB due to the -- most of the data is in JSON and the flexibility of [document] (ph) model makes it a very compelling play. And so I would say that, it really depends on the customer's use case. What it really does is it just enables us to go after more workloads more quickly, and it really positions us as a truly strategic supplier to large enterprises and obviously, a critical supplier for early-stage companies, and that's our strategy, is to get customers to use MongoDB for a variety of use cases across a variety of deployment models.",
  "Michael Gordon",
  "The other thing that I'd add, which is probably implicit and comes across that, but I think it's important enough to make explicit is one thing that, that sort of, Rich, in your question, sort of the slice-by-slice view misses is the aggregate benefit of delivering the whole platform, right, in delivering a common integrated unified experience to developers so they don't have to use a bunch of point solutions. And I think that's really a key part of the strategy.",
  "Unidentified Analyst",
  "Got it. That makes perfect sense. Thank you.",
  "Operator",
  "Thank you. One moment for the next question. Our next question will be coming from Brent Bracelin of Piper Sandler. Your line is open.",
  "Brent Bracelin",
  "Good afternoon. This is Brent. I believe Iâ\u0080\u0099m -- was next there. Dev, I wanted to talk a little bit about AI. And Mongo has been at the leading powering new apps for the better part of the decade. We're all trying to figure out what this AI [first world] (ph) looks like, given your purview as a new app enabler, what's your sense in the next three to four years, how many of these new apps are going to layer in large language models? And what is the net result on the database? Thanks.",
  "Dev Ittycheria",
  "Yeah. So Brent, thanks for your question. I firmly believe that we, as an industry, tend to overestimate the impact of a new technology in the short term and underestimate the impact in the long term. So as you may know, there's a lot of hype in the market right now, in the industry right around AI and in some of the early stage companies in the space have -- the valuations are to the roof. In some cases, almost -- it's hard to see how people can make money because the risk reward doesn't seem to be sized appropriately. So there's a lot of hype in the space. But I do think that AI will be a big impact for the industry and for us long term. I believe that almost every application, both new and existing, will have some AI functionality embedded into the application over the next -- in your horizon three to five years.",
  "And let me just remind people why we see -- where we see AI impacting our business. One, developers will become far more productive with the use of code generation and code assist tools. What that will mean is like that will lead to more applications, which means they need more databases and more data platforms. Second, developers will use things like generative AI to just build smarter and more intelligent applications. One, they don't want to use point solutions because it's clear developers want one platform to process and analyze data and metadata and vectorized data and MongoDB is that platform. So which is why in so much interest. And Vector Search, I believe, is really ultimately a feature, not a product. And essentially, it's basically enabling people to marry private data with public data to really offer a compelling experience and there's so much interest in our public preview right now.",
  "And as we -- as I mentioned earlier, we've continued to add many more AI customers this quarter and we think the impact will be big. But in the short term, these are still smaller workloads, but they're going to grow over time. Some of the use cases are really interesting, but the fact is that we're really well positioned because what generative AI does is really instantiate AI in front of -- in software, which means developers play a bigger role rather than data scientists, and that's where you'll really see the business impact. And I think that impact will be large over the next three to five years.",
  "Brent Bracelin",
  "Super helpful color there. And a quick follow-up for Mike. Three-year annual growth rate for EA is over 20%. It slipped below 10% in Q1, spiked now about 30% here in Q2, excluding the licensing multiyear deals. If you continue to see enterprise workload migrations happen, why can't you continue to see strength in EA?",
  "Michael Gordon",
  "Yeah. So a couple of things. I think as Dev mentioned, some of the Relational Migrations, with the destination of those, whether it's Enterprise Advanced or Atlas will depend on the customers cloud strategy and their overall approach from like an IT strategy standpoint. Certainly, some of that could benefit EA, and we've continued to see robust adoption and adoption of new workloads within that EA customer base. I think the key thing, at least thinking about the back half of this year, and as you start thinking about next year, is just we have had very strong results from EA. And so we think about EA on a compare basis, I just think it's really important to keep in mind.",
  "Unidentified Analyst",
  "Okay. Thank you.",
  "Operator",
  "Thank you. One moment for the next question. Our next question will be coming from Jason Ader of William Blair. Your line is open.",
  "Jason Ader",
  "Yeah. Thank you. Good afternoon. Just wanted to get a sense on EA. You talked about doing a good job of existing customers adding incremental workloads. What's the main driver there? Is there something you're doing differently? Or do you think it's just maturity and customers getting more comfortable with you for more workloads?",
  "Dev Ittycheria",
  "Yeah. I think it's really a function of people really recognizing that MongoDB is truly a standard. It's a platform they can bet on to run the most mission-critical use cases and the flexibility of the deployment models means that they can start on-prem, but they can always migrate to the cloud. And so that optional -- that built-in optionality also makes going to EA that much more comforting because it's not like they'll be locked into an on-prem solution or locked into some proprietary cloud solutions. So that that's why I believe, just given our maturity given how we're really becoming a standard in so many organizations, people are much more comfortable doubling down on EA.",
  "Jason Ader",
  "Got you. And then just to follow up on that on EA question. It seems like -- I mean, I don't want to put words in your mouth, but it seems like maybe you've been a little bit surprised at the strength of EA relative to Atlas over last year. I mean Atlas has been really strong, too, but EA has, I think, surprised you more to the upside. What does that say, I guess, about kind of on-prem versus cloud or self-managed versus fully managed. Any comments on that, Dev?",
  "Dev Ittycheria",
  "Yeah. What I would say is it really is a reinforcement that customers still will run workloads on-prem, that they still will run workload they want to manage themselves versus use a managed service like Atlas. And so -- and I think customers value choice. And customers value the ability to have different deployment models, but also value the fact that if they want to migrate from one deployment model to another, it's easiest to do so using MongoDB. So I think what we're really seeing is customers valuing choice and to run anywhere strategy is really resonating with customers.",
  "Michael Gordon",
  "And I would just add, Jason, that the premise of your question is correct. We have been very surprised, obviously, pleasantly so, with the performance of EA. It's been terrific to see, but it's definitely been surprising to the upside.",
  "Jason Ader",
  "Great. Thank you.",
  "Operator",
  "Thank you. One moment for the next question, please. And the next question will be coming from Tyler Radke of Citi. Your line is open.",
  "Tyler Radke",
  "Yes. Thanks for taking the question. So Atlas revenue grew by almost $30 million quarter-over-quarter, which is the highest you've ever seen it. Certainly, that performance is better than any of the other consumption models you're seeing. It seems like the commentary at least on Atlas, consumption was pretty consistent with your expectations and still a bit below where it had been pre some of the macro challenges. So could you just kind of unpack what what's driving that strength and revision back to kind of record high levels of sequential dollar adds? Is it better pricing just given some of the sales changes you made or perhaps maybe it's the new AI use cases that you talked about. If you could just help us understand that a bit better. Thank you.",
  "Michael Gordon",
  "Yeah. Thanks for the question, Tyler. A few things. If you're looking at an absolute dollars basis, obviously, the business is much larger. So let's start with that. Secondly, if we're looking at the sequential from Q1 to Q2, remember, Q1 has fewer days. And so that's obviously part of the dynamic, and you'll see that historically as well. And then third, we had talked about the Q1 consumption being better than planned, and therefore, the starting ARR in Q2 being better. We saw the consumption itself kind of once we had that -- once you kind of adjust for that higher starting base, broadly in line with our expectations. So slightly better, but not big upside there. And when we look at it in the back half of the year, that's what we're continuing to assume is that same trend line, obviously, seasonally adjusted based on those emerging seasonal patterns. But that's really how to kind of tie and square all the numbers.",
  "Tyler Radke",
  "Okay. That's helpful. And then a follow-up question, just in terms of the excitement, obviously, out in the industry around generative AI. But I guess I'm curious specifically how internally you're using generative AI in products like relational migrator to automate a lot of the re-architecture process? And secondly, are you seeing a greater appetite from customers to modernize kind of legacy transactional applications. And is that starting to pick up just given the excitement around Gen AI? Thank you.",
  "Dev Ittycheria",
  "Yeah. So with regards to Gen AI, I mean, we do see opportunities, essentially, the reason when you migrate off using Relational Migrator, there's really three things you have to focus on. One is mapping the schema from the old relational database to the MongoDB platform. Moving the data appropriately and then also rewriting some, if not all, of the application code. Historically, that last component has been the most manually intensive part of the migration, obviously, with the advance of code generation tools, thereâ\u0080\u0099s opportunities to automate the rewriting of the application code. I think we're still in the very early days. You'll see us continue to add new functionality to Relational Migrator to help again reduce the switching costs of doing so. And that's obviously an area that we're going to focus. So that's in some ways, a big opportunity for us. And Tyler, there was the second part to your question, which I...",
  "Tyler Radke",
  "Yeah. Yeah, it was just around the customer appetite, like is that the frenzy around Gen AI, is that causing an acceleration in the pace in which customers want to take on these modernization projects?",
  "Dev Ittycheria",
  "Yeah. So I would say that the recent MongoDB is well suited for these new modernization projects is, one, obviously, the data that's trapped in these legacy platforms is incredibly important if you want to leverage that proprietary data for a competitive advantage. Two, is that the performance requirements of these new modern applications require a new modern platform. And three, because it's such an iterative area where people are -- is changing so quickly, you all see the platform that's inherently flexible. So that's driving people to move to MongoDB and to more modern platforms more quickly. So unlike the old lift and shift where people are just trying to say, avoid paying the Oracle tax, now people are being much more thoughtful about not just lifting and shifting, but modernizing and going off relational to MongoDB. And that's definitely a trend that's increasing.",
  "Tyler Radke",
  "Thank you.",
  "Dev Ittycheria",
  "Thanks, Tyler.",
  "Operator",
  "Thank you. One moment for the next question. And our next question will be coming from Patrick Walravens of JMP Securities. Your line is open.",
  "Unidentified Analyst",
  "Hi. This is [Owen] (ph) for Pat. Thanks for taking the question and congrats on the strong quarter. Just a quick one for me. What will the pricing structure for some of the new features like Vector Search and Stream Processing be?",
  "Dev Ittycheria",
  "So the pricing will be a function of the -- obviously, the consumption of the back-end infrastructure that supports those new capabilities. So they'll show up as essentially more consumption of Atlas clusters, or increases of clusters depending on the load of the application, and will show up on the Atlas revenue line.",
  "Patrick Walravens",
  "Great. Thank you.",
  "Operator",
  "Thank you. One moment for the next question. And our next question will be coming from Michael Turits of KeyBanc. Your line is open.",
  "Michael Turits",
  "Hello?",
  "Dev Ittycheria",
  "Hey, Michael.",
  "Michael Turits",
  "My name got [indiscernible], I wasn't sure it was me. Thanks. Quick one for you, Mike, and then one for Dev. Very quick. Mike, are you able to comment on the linearity in the quarter relative to those consumption growth trends and how we exited? And then, Dev, for you, you just said that you think that Vector Search is a feature, not a product. There are as you know, two databases deliberately out there, explicitly out there in the market. And then, you, as well as others, who don't have vector databases, including Google, with [Allo] (ph) the other day, are talking about the applicability of their databases for vector embedding. So can you talk about how that's playing out as far as you can tell with customers in terms of their receptivity of looking for something besides a dedicated vector database for this? So linear question and then that one.",
  "Michael Gordon",
  "Sure. Yeah, just quickly in linear, I don't think there's anything particularly point out of note there.",
  "Dev Ittycheria",
  "And so regarding Vector Search, and I've shared this with other -- talked about this previously, Vector Search is really a reverse index. So it's like an index that's built into all databases. I believe, over time, Vector Search functionality will be built into all databases or data platforms in the future. Yes, there are some point products that are just focused solely on Vector Search. But essentially, it's a point product that still needs to be used with other technologies like MongoDB to store the metadata, the data to be able to process and analyze all that information. So developers have spoken loudly that having a unified and elegant developer experience is a key differentiator. It removes friction in how they work. It's much easier to build and innovate on one platform as learning and supporting multiple technologies. And so my strong belief is that, ultimately, Vector Search will be embedded in many platforms and our differentiation will be, again, like it always has been a very compelling and elegant developer experience.",
  "Michael Turits",
  "Thanks, Dev and Mike.",
  "Operator",
  "Thank you. And one moment for the next question. Our next question will be coming from Mike Cikos of Needham. Your line is open. Mike Cikos of Needham, your line is open.",
  "Mike Cikos",
  "I'm sorry. I apologize, the operator [indiscernible] Thanks for getting me on the call here, guys. If I could just follow up on, Dev, your comments there in response to Michael on the Vector Search. I know that we're talking about the developers and how they they're voting here because they want the data in a unified platform, a unified database that preserves all that metadata, right? But I would think there's probably also a benefit to having it all in a single platform as well just because you're lowering the TCO for your customers as well, right? They're not paying a tax for the movement or duplication of all that data between different vendors. Is that also a fair assumption when I'm thinking about the potential that you guys bring versus maybe some of those more point features or databases out there?",
  "Dev Ittycheria",
  "Well, with vectors, vectors are really a mathematical representation of different types of data. So thereâ\u0080\u0099s not a tonne of data, unlike application search, where there's a profound benefits by storing everything on one platform versus having an operational database and a search database and some glue to keep the data in sync. That's not as much the case with Vector because you're talking about storing essentially an elegant index. And so it's more about the user experience and the development workflow that really matters. And what we believe is that offering the same taxonomy in the same way they know how to use MongoDB to also be able to enable Vector Search functionality is a much more compelling differentiation than a developer have to bolt-on a separate vector solution and have to provision, configure and manage that solution along with all the other things they have to do.",
  "Mike Cikos",
  "Got it. Thank you for helping clear my understanding on that. And then just a quick follow-up for Michael. Michael, I've gotten a couple of inbounds just trying to unpack the Q3 revenue guide here, specifically as it pertains to Atlas. And I think what people are looking at is, I think Atlas embed slower sequential growth on a daily consumption basis. The questions I'm getting are, was there anything onetime 2Q that would cause us to think that the daily Atlas consumption growth would decelerate going into 3Q? Or anything else you can tease out there while we have you?",
  "Michael Gordon",
  "No. I think if you look at what we said is the real underlying reason for the increase, obviously, we don't guide by product, but we are trying to give you a whole bunch of color around it, the real increase -- and the Atlas number is given the slight outperformance in Q2, we have a starter hiring ARR in Q2, and that's at the beginning of Q3. And that's really what's flowing through in the numbers and in the guidance.",
  "Mike Cikos",
  "Terrific. Thank you very much guys, I appreciate it.",
  "Dev Ittycheria",
  "Thank you, Mike.",
  "Michael Gordon",
  "Thanks, Mile.",
  "Operator",
  "Thank you. This concludes the Q&A session for today. And I would now like to turn the call back over to Dev Ittycheria, CEO, for closing remarks. Please go ahead.",
  "Dev Ittycheria",
  "Thank you, everyone, for joining us today. I just want to reinforce that we had another strong quarter of new business performance, which really validates our value proposition and our run anywhere strategy. Again, we remain focused on our North Star, which is acquiring new workloads, both from new workloads -- new customers and existing customers. And we're innovating both on the product and go-to-market dimensions to accelerate workload acquisition. And while it's early days, we believe that with the rise of AI, MongoDB will be a beneficiary of as AI becomes more prominent. Thank you very much, and I appreciate all your time. Take care.",
  "Operator",
  "This concludes today's conference call. Thank you all for participating and enjoy the rest of your evening. You may now disconnect."
]