[
  "MongoDB, Inc. (NASDAQ:MDB) Q1 2024 Earnings Call Transcript June 1, 2023 5:00 PM ET",
  "Company Participants",
  "Brian Denyeau - Investor Relations, ICR Dev Ittycheria - President & Chief Executive Officer Michael Gordon - Chief Operating Officer & Chief Financial Officer",
  "Conference Call Participants",
  "Raimo Lenschow - Barclays Sanjit Singh - Morgan Stanley Brad Reback - Stifel Brent Bracelin - Piper Sandler Kash Rangan - Goldman Sachs Karl Keirstead - UBS Tyler Radke - Citigroup Jason Ader - William Blair Fred Havemeyer - Macquarie Capital Kingsley Crane - Canaccord Genuity Michael Turits - KeyBanc Michael Cikos - Needham Firoz Valliji - Alliance Bernstein Howard Ma - Guggenheim Partners",
  "Operator",
  "Thank you for standing by, and welcome to MongoDB's First Quarter Fiscal Year 2024 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session. [Operator Instructions]",
  "I would now like to hand the call over to Brian Denyeau with ICR. Please go ahead.",
  "Brian Denyeau",
  "Great. Thank you, Latif. Good afternoon, and thank you for joining us today to review MongoDB's first quarter fiscal 2024 financial results, which we announced in our press release issued after the close of market today. Joining me on the call today are Dev Ittycheria, President and CEO of MongoDB; and Michael Gordon, MongoDB's COO and CFO.",
  "During this call, we will make forward-looking statements, including statements related to our market and future growth opportunities, the benefits of our product platform, our competitive landscape, customer behaviors, our financial guidance and our planned investments. These statements are subject to a variety of risks and uncertainties, including the results of operations and financial conditions that could cause actual results to differ materially from our expectations.",
  "For a discussion of the material risks and uncertainties that could affect our actual results, please refer to the risks described in our Annual Report on Form 10-K for the year ended January 31, 2023, filed with the SEC on March 17, 2023. Any forward-looking statements made on this call reflect our views only as of today and we undertake no obligation to update them, except as required by law.",
  "Additionally, we will discuss non-GAAP financial measures on this conference call. Please refer to the tables in our earnings release on the Investor Relations portion of our website for a reconciliation of these measures to their most directly comparable GAAP financial measures.",
  "With that, I'd like to turn the call over to Dev.",
  "Dev Ittycheria",
  "Thanks, Brian, and thank you to everyone for joining us today. I'm pleased to report that we had another strong performance in the first quarter and we continue to execute well despite challenging market conditions. I will start by reviewing our first quarter results before giving you a broader company update. But first, I would like to personally invite all of you to the Investor session at MongoDB.local New York City to be held at the Javits Center on June 22. Please email ir@mongodb.com if you're interested in attending.",
  "Now turning to our results. We generated revenue of $368 million, a 29% year-over-year increase and above the high-end of our guidance. Atlas revenue grew 40% year-over-year, representing 65% of revenue. And we had another strong quarter of customer growth, ending the quarter with over 43,100 customers. Overall, we delivered a strong Q1. We had a very healthy quarter of new business acquisition. We added approximately 2,300 customers during the quarter, the highest number in over two years, including over 300 new direct sales customers with notable strength in our Enterprise channel.",
  "Our ongoing new business success is due to the mission criticality of our platform and sharp execution by our go-to-market teams, who are navigating a difficult selling environment by remaining laser-focused on our North Star acquiring new workloads. In fact, this quarter, we acquired a record number of new workloads from our existing customers.",
  "Moving on to Atlas consumption trends. Q1 consumption was ahead of our expectations but remains below the levels we saw prior to the macro slowdown that began last year. Michael will share more detail on this. Finally, retention rates remained strong in Q1, reinforcing the enduring value in our platform.",
  "We are pleased with our results this quarter, especially given the difficult macro environment. It's clear, customers continue to scrutinize our technology investments and must decide which technologies are a must have versus a merely and nice to have. We believe that our Q1 performance and continued new business strength demonstrate that MongoDB is clearly a must have for customers. In today's digital economy, most companies express their business strategies through software. They use software to deliver their core value proposition, provide customers with great experiences and drive operational efficiency. MongoDB is an essential platform in this drive for innovation, making us the critical investment priority.",
  "Our customers ranging from the largest companies in the world to cutting-edge startups use our developer data platform to develop and run mission-critical applications. As these applications become successful, customers spend more with MongoDB. In other words, their spend on our platform is directly aligned with the usage of their underlying application, therefore, the value they derive from it. While the growth rate of existing applications can vary based on a number of factors including macro conditions, the relationship between application usage and growth -- application usage growth and MongoDB spend has remained consistent. We believe this is a testament to how well our value proposition is aligned to our customer success.",
  "Thinking about a long-term opportunity, I feel exceptionally confident about our core underlying growth driver, the need for companies to use software as a competitive advantage. Customers have ever-increasing expectations for better products, services and experiences, and companies rely on custom-built suffer to deliver these expectations better and faster than the competition.",
  "As I've said many times in the past, a durable competitive advantage is built through custom software, it cannot be obtained with an off-the-shelf product. Since most companies understand that they and their competition are all differentiating themselves through software, the speed of software development becomes existential. A McKinsey report found that companies that score in the top quartile of developer velocity generate revenue growth that is four times to five times faster than companies in the bottom quartile. MongoDB is built for speed.",
  "We believe AI will be the next frontier of development productivity -- developer productivity and will likely lead to a step-function increase in software development velocity. We know that most organizations have a huge backlog of projects they would like to take on, but they just don't have the development capacity to pursue. As developer productivity meaningfully improves, companies can dramatically increase their software ambitions and rapidly launch many more applications to transform their business. Consequently, the importance of development velocity to remain competitive will be even more pronounced. Said another way, if you are slow, then you're obsolete.",
  "Moreover, the shift to AI will favor modern platforms that offer a rich and sophisticated set of capabilities, delivered in a performance and scalable way. We are observing an emerging trend where customers are increasingly choosing Atlas as a platform to build and run new AI applications. For example, in Q1, more than 200 of the new Atlas customers were AI or ML companies. Well finance startups like Hugging Face, Tekion, One AI and [Nuro] (ph) are examples of companies using MongoDB to help deliver the next wave of AI-powered applications to their customers. We also believe that many existing applications will be re-platformed to be AI-enabled. This will be a compelling reason for customers to migrate from legacy technologies to MongoDB.",
  "To summarize, AI is just the latest example of the technology that promises to accelerate the production of more applications and greater demand for operational data stores, especially the ones best suited for modern data requirements such as MongoDB. We look forward to telling you more at our Investor session on June 22.",
  "Now I'd like to spend a few minutes reviewing the adoption trends of MongoDB across our customer base. MongoDB's developer data platform continues to gain momentum as customers across industries and around the world are running their mission-critical projects on Atlas. Organizations, including Anywhere Real Estate, GE Healthcare and Intuit are leveraging the power of our developer data platform.",
  "GE Healthcare has turned to MongoDB's developer data platform to manage the lifecycle of its IoT devices, imaging, ultrasound and other patient-care devices from deployment to retirement. They selected Atlas for its effective management, scalability, built-in security and multi-cloud support. GE Healthcare's use of Atlas helps healthcare providers enhance productivity by reducing the complexity and time required to manage databases, resulting in an 83% decrease in data retrieval time and enabling faster deployment of IoT devices. Many customers are turning to MongoDB to free up their developer's time for innovation, enabling them to move faster and deliver better customer experiences, while driving cost-savings. This includes China Mobile, Tata Digital and Grant Thornton International.",
  "China Mobile provides mobile voice and multimedia services via its nationwide mobile telecom network across Mainland China and Hong Kong. It is the world's largest mobile network operator by total number of subscribers. The telecom leader is using MongoDB to support one of its largest and most critical push services, which sends out billing details to more than 1 billion users every month. Prior to MongoDB, the tech team relied on Oracle. But as the user numbers increase, performance degraded. Despite large investments, it was still taking too long to do basic requests like finalize and deliver bills to users. As a result, China Mobile migrate this service to MongoDB after comprehensive testing and evaluation of alternatives. By taking advantage of MongoDB's native [sharding] (ph), they were able to improve performance by 80% and go from 50 Oracle machines to just 12 machines for the same workload. This service now handles all current requirements and is set up to scale with future growth.",
  "Digital transformation is redefining how organizations operate, and MongoDB is helping customers on this journey by delivering the developer data platform that powers the migration from on-premises to the cloud. Companies including Shutterfly, Radio and Bendigo and Adelaide Bank are example of customers leveraging MongoDB in their transformations.",
  "A leader in the HR and job finding tech space shifted from MongoDB Community to MongoDB Atlas during its journey to migrate its entire infrastructure from on-premises to the cloud. They selected MongoDB Atlas to give its developers full autonomy over their data, while freeing up the time they previously spent managing their database system to focus on innovation and improving the end user experience. During their migration journey to Atlas, the company identified [indiscernible] significant infrastructure reduction and subsequent cost-savings. In addition, the company has experienced 250% faster query performance and 300% faster right throughput on their applications built on Atlas.",
  "In summary, I'm pleased with our first quarter results in a difficult macro environment. Our ability to win new workloads remain strong and Atlas consumption trends were better than expected. We also believe that AI will accelerate application development, which would further stimulate demand for MongoDB. We continue to invest to maximize our long-term growth opportunities.",
  "With that, here's Michael.",
  "Michael Gordon",
  "Thanks, Dev. As mentioned, we delivered a strong performance in the first quarter, both financially and operationally. I'll begin with a detailed review of our first quarter results, and then finish with our outlook for the second quarter and full fiscal year 2024. First, I'll start with our first quarter results.",
  "Total revenue in the quarter was $368.3 million, up 29% year-over-year. As Dev mentioned, we continue to see a healthy new business environment, both in terms of acquiring new customers, as well as acquiring new workloads within existing customers. To us, this is confirmation we remain a top priority for our customers and that our value proposition continues to resonate even in this market.",
  "Shifting to our product mix. Let's start with Atlas. Atlas grew 40% in the quarter compared to the previous year and represents 65% of total revenue compared to 60% in the first quarter of fiscal 2023, and 65% last quarter. As a reminder, we recognize Atlas revenue primarily based on customer consumption of our platform and that consumption is closely related to end-user activity of the application, which can be impacted by macroeconomic factors.",
  "Let me provide some context on Atlas consumption in the quarter. As Dev mentioned, consumption growth in Q1 was above our expectations. This outperformance was broad-based and driven by stronger growth in underlying application usage. While Q1 consumption trends were better than expected, the growth remains below the levels we had experienced prior to the beginning of the slowdown in Q2 of last year.",
  "Turning to Enterprise Advanced. As you know, we will be facing very difficult EA compares throughout fiscal 2024, and Q1 was no exception as evidenced by our slower year-over-year EA revenue growth. However, EA revenues were up sequentially, which is better than what we had anticipated in our Q1 guidance. This is despite the fact that Q1 is typically a seasonally slower new business quarter for EA.",
  "Turning to customer growth. During the first quarter, we grew our customer base by approximately 2,300 customers sequentially, bringing our total customer count to over 43,100, which is up from over 35,200 in the year-ago period. Of our total customer count, over 6,700 are direct sales customers, which compares to over 4,800 in the year-ago period. As a reminder, our direct customer count growth is driven by customers who are net-new to our platform as well as self-serve customers with whom we've now established a direct sales relationship.",
  "We saw a strong quarter of customer -- of direct customer additions in our enterprise channel. The growth in our total customer count is being driven primarily by Atlas, which had over 41,600 customers at the end of the quarter compared to over 33,700 in the year-ago period. It is important to keep in mind that growth in our Atlas customer count reflects new customers to MongoDB in addition to existing EA customers adding incremental Atlas workloads. We had another quarter with our net expansion -- ARR expansion rate above 120%. We ended the quarter with 1,761 customers with at least $100,000 in ARR and annualized MRR, which is up from 1,379 in the year-ago period.",
  "Moving down the income statement. I'll be discussing our results on a non-GAAP basis unless otherwise noted. Gross profit in the first quarter was $279.9 million, representing a gross margin of 76%, which is up from 75% in the year-ago period. We're very pleased with our gross margin progression, especially in the context of Atlas representing 65% of our overall business.",
  "Our income from operations was $43.7 million, or 12% operating margin for the first quarter compared to a 6% margin in the year-ago period. The primary reason for our strong operating income results versus guidance is our revenue outperformance. In addition, Q1 benefited from the timing of marketing programs, internal events and other expenses, which we now expect to incur later in the year.",
  "Net income for the first quarter was $45.3 million or $0.56 per share based on 81.5 million diluted weighted average shares outstanding. This compares to net income of $15.2 million or $0.20 per share on 77 million diluted weighted average shares outstanding in the year-ago period.",
  "Turning to the balance sheet and cash flow. We ended the first quarter with $1.9 billion in cash, cash equivalents, short-term investments and restricted cash. Operating cash flow in the first quarter was $53.7 million. After taking into consideration approximately $2 million in capital expenditures and principal repayments of finance lease liabilities, free cash flow was $51.8 million in the quarter. This compares to free cash flow of $8.4 million in the first quarter of fiscal 2023.",
  "I'd now like to turn to our outlook for the second quarter and full fiscal year 2024. For the second quarter, we expect revenue to be in the range of $388 million to $392 million. We expect non-GAAP income from operations to be in the range of $36 million to $39 million and non-GAAP net income per share to be in the range of $0.43 to $0.46 based on 82.5 million estimated diluted weighted average shares outstanding.",
  "For the full fiscal year 2024, we expect revenue to be in the range of $1.5 billion to $2 billion to $1.542 billion. For the full fiscal year 2024, we expect non-GAAP income from operations to be in the range of $110 million to $125 million, and non-GAAP net income per share to be in the range of $1.42 to $1.56 based on 83 million estimated diluted weighted average shares outstanding. Note that the non-GAAP net income per share guidance for the second quarter and full year fiscal 2024 includes a non-GAAP tax provision of approximately 20%.",
  "I'll now provide some more context around our guidance, starting with Q2. First, I want to remind you that Q2 has three more days than Q1, which is a tailwind for Q2 Atlas revenue. Second, we expect to see a sequential decline in the EA business after a stronger than expected Q1. Third, we recently signed a few large licensing deals, most notably a renewal and extension of our relationship with Alibaba. Those deals have an upfront license revenue component, which will positively impact our revenue in Q2 by roughly $10 million. You will see this impact in other subscription revenues, the portion that is neither Atlas nor EA. Finally, we expect to see a significant sequential uptick in expenses since we have some of our largest sales and marketing events in Q2, most notably MongoDB.local in New York.",
  "Turning to our updated full year guidance. First, we are increasing our revenue expectations for the rest of the year because Atlas Q1 exit ARR is now higher than previously expected given the stronger Q1 performance. Second, we continue to expect that Atlas consumption growth will be impacted by the difficult macro environment throughout fiscal 2024. Our revised full year revenue guidance continues to assume consumption growth that is in line with the average consumption growth we've experienced since the slowdown began in Q2 of last year. In other words, our usage growth assumptions for the remainder of the year remain unchanged from what we provided our initial guidance range for fiscal 2024 last quarter. Third, we continue to expect that the year-over-year growth of Enterprise Advanced will be impacted by the difficult compares from the prior-year period.",
  "Finally, thanks to strong Q1 performance and the increased revenue outlook, we are meaningfully increasing our assumption for operating margins in fiscal 2024 to 7.7% at the midpoint of our guidance, an improvement of approximately 300 basis points compared to fiscal 2023, while continuing to invest to pursue our long-term opportunity.",
  "To summarize, MongoDB delivered strong first quarter results in a difficult environment. Our new business performance and strong total customer net additions demonstrate the continued demand for our developer data platform. While we are pleased that Atlas Q1 consumption growth was above our expectations, we continue to be mindful of the environment, taking a step back from the near-term trends. We are incredibly excited about the opportunity ahead and we'll continue to invest responsibly to maximize our long-term value.",
  "With that, we'd like to open up to questions. Operator?",
  "Question-and-Answer Session",
  "Operator",
  "Yes, sir. [Operator Instructions] Our first question comes from the line of Raimo Lenschow of Barclays. Your question please, Raimo.",
  "Raimo Lenschow",
  "Thank you. My first question before I have to follow-on -- follow-up question. Dev, if you -- everyone talks about AI at the moment and Mongo in theory always kind of view as an operational database. How do you fit into this kind of new AI world? You mentioned some of the names and some of the projects that would look really exciting. But how does Mongo kind of fit into this new world? And I had one follow-up for Michael.",
  "Dev Ittycheria",
  "Yeah. Sure, Raimo. First, we expect MongoDB to be a net beneficiary of AI. And the reason being is that as developer productivity increases, the volume of new applications will increase, which by definition will create new apps, which means more data stores. So driving more demand for MongoDB. Second, developers will be attracted to modern platforms like MongoDB because that's the place where they can build these modern next-generation applications. And third, because of the breadth of our platform and the wide variety of use cases we support that becomes even more of an impetus to use MongoDB.",
  "As I mentioned that we've had over 200 customers just in last quarter who are running AI apps on Atlas. Some of those includes some very cutting-edge well-financed startups like Nuro and Hugging Face and Tekion. We have a high degree of existing customers who are engaging with our field organizations on AI use cases. And so the demand for using MongoDB to build and run these AI apps is very high.",
  "Raimo Lenschow",
  "Okay. Perfect. Thank you. And Michael, if I look at the update or the significant upgrade to the profitability outlook, like, obviously, you had your budgeting cycle to come up with the initial guidance. So what has changed besides maybe slightly higher revenue to kind of come up with these kind of much higher numbers? And obviously, we all like that. But like, what drove that? Thank you and congrats from me.",
  "Michael Gordon",
  "Thanks. Yes. The big driver of the improved bottom line output is the stronger Q1 performance and then the upgraded revenue outlook and it's really just sort of flowing through to the P&L.",
  "Raimo Lenschow",
  "Okay. Perfect. Thank you.",
  "Operator",
  "Thank you. Our next question comes from the line of Sanjit Singh of Morgan Stanley. Your line is open, Sanjit.",
  "Sanjit Singh",
  "Thank you for taking the questions and congrats to the MongoDB team on a strong start to the year. I wanted to start off -- just a question on the environment. As we talked -- as we listen to the [Hyperscalers] (ph) report, their results seem some of the cloud infrastructure ecosystem reported results. We're all trying to get a sense of where are we in sort of the cloud optimization budget scrutiny sort of cycle. It sounded like from what you guys are saying that you guys are executing well, but things are still pretty tight from a budget environment perspective.",
  "So wanted to get your sort of latest perspective on whether you see cloud spend and optimization headwinds fading anytime soon? And then what you saw in May that potentially gave you maybe some leading indicators on where things may be headed?",
  "Dev Ittycheria",
  "Yes. So first point I'd make, Sanjit is that, we don't really see optimization as a trend because there's a direct link between app usage and our revenue, right? So the more the apps are used, the more revenue that drives. And consequently, when apps are used less, the less revenue we get. And so, there's a one-to-one correlation between usage and revenue, which as you can imagine, when the customers are building these apps, they want their apps to be used. So that's really what's happening in terms of what's driving our revenue.",
  "In terms of what's happening in terms of the macro environment, I definitely agree with you that it's tough out there, but what we see is innovation is still a priority. We see that customers really want to leverage software as a competitive advantage. We had very strong new business numbers. We added 2,300 customers this year. Our six figure customer count grew 28% year-over-year and our Atlas growth was 40% year-over-year. So like these are pretty good signs that customers are still prioritizing innovation and they're doing so leveraging modern platforms like MongoDB.",
  "So I would also say that our go-to-market channels have to really focus on and are doing a really good job on qualifying these opportunities, being able to separate customers who are serious versus customers who may be just wanting to kick the tires. And again, as I mentioned earlier, it's all about us acquiring high-quality workloads. If we can hire -- acquire high-quality workloads, onboard them well and make sure they're served as well, good things will happen; and that's happening. And we had a record number of new workloads added this quarter from existing customers.",
  "Sanjit Singh",
  "I appreciate the perspective, Dev. I just wanted to follow up on Raimo's question on AI. And I guess the context is that, you guys have proven that the document model has been very, very scalable in terms of addressing multiple different types of workloads and different data types. So in the context of large language model applications and customers trying to build applications with large language models and the rules of vectors and vector databases, from your guys' perspective, is this a use case that MongoDB can address? And any sort of product updates or anything on the product road map to address this part of the market?",
  "Dev Ittycheria",
  "Right. So -- and maybe I'll just do a little primer just so everyone is on the same page. The results that come from training and LLM against content are known as vector embeddings. And so content is assigned vectors and the vectors are stored in a database. These databases then facilitate searches when users query large language modeling with the appropriate vector embeddings, and it's essentially how a user searches match to content from an LLM. The key point, though, is that you still need an operational data store to store the actual data. And there are some adjunct solutions out there that have come out that are bespoke solutions but are not tied to actually where the data resides, so it's not the best developer experience.",
  "And I believe that over time, people will gravitate to a more seamless and integrated platform that offers a compelling user experience. And I do want to say it's still very early days. I think people tend to overestimate the impact of new trends in the short term but underestimate them in the long term. So it's very early days. And I think you're going to see a lot of things happening over the course of the next few months and quarters and years, but we feel we're in a very good position to take advantage of this new trend.",
  "Sanjit Singh",
  "I appreciate the comments, Dev. Thank you very much.",
  "Operator",
  "Thank you. Our next question comes from the line of Brad Reback of Stifel. Your question please, Brad.",
  "Brad Reback",
  "Great. Thanks very much. Dev, last quarter you talked about a couple of very large financial institutions beginning to migrate, I believe it was hundreds of apps. I know you talked about better usage trends this quarter. Was that -- did those migrations impact this quarter? Or is that more something we should expect in the coming quarters?",
  "Dev Ittycheria",
  "No, they'll -- I mean -- so one, we're obviously we are very happy about customers wanting to migrate a large percentage of their applications to MongoDB, but that takes time, right? It's not going to happen overnight. And so, that's going to happen over the long term and so that's something that's a trend that we're feeling good about. I would say, in terms of the usage trends, it's again tied to our customers' underlying business. And so the applications of building on MongoDB are clearly being used. They're driving value, which consequently drives our revenue; and we feel really good. And again -- so that drives us to go acquire more workloads, high-quality workloads, that we can then onboard quickly. And then that drives future usage, so that's the real focus for us. That's focus on the input metrics that drive the outputs that you see. And that's an example what happened this quarter.",
  "Brad Reback",
  "That's great. And then Michael, real quick. Since the year got off to such a great start here, does it impact your hiring plans for the rest of this fiscal year? Thanks.",
  "Michael Gordon",
  "Yes, thanks for the question, Brad, yes. Strong start to the year, no major changes. Obviously all that's factored into the full year guide, and you can see the significant upgrade in the bottom line outlook. We are obviously continuing to invest for the long term, though, and believe that we can walk and chew gum at the same time.",
  "Brad Reback",
  "That's great. Thanks very much.",
  "Operator",
  "Thank you. Our next question comes from the line of Brent Bracelin of Piper Sandler. Your question please, Brent.",
  "Brent Bracelin",
  "Thank you. Dev, what drove the record number of new workloads migrating to the platform? You flagged that in the comments there. It seems a little too early for Gen AI to be driving the number of new workloads, so what drove that [indiscernible] as well? Thanks.",
  "Dev Ittycheria",
  "Yes. Like I said, I think people tend to overestimate the impact of a trend like AI in the short term. And so I will clearly say it wasn't AI that drove the acquisition of workloads. It was really sharp execution by go-to-market teams. We have really focused our teams to acquire workloads either through the acquisition of new customers or the acquisition of workloads in existing customers. It's all about acquiring workloads, so our incentive mechanisms, management attention and focus is all about this North Star about acquiring new workloads. And I saw -- and I think you've seen the results of that showing up in Q1.",
  "Brent Bracelin",
  "Great, blocking and tackling and walking while chewing gum. Sounds like it's working for you. My follow-up is really around a vector feature engine as you think about AI. How important is layering in vector feature engines inside of the Mongo database? Is that on the docket? How should we think about vector functionality inside of Mongo going forward relative to attracting more Gen AI workloads? Thanks.",
  "Dev Ittycheria",
  "Again, for generating content that's accurate in a performant way, you do need to use vector embeddings which are stored in a database. And you -- but you also need to store the data and you want to be able to offer a very compelling and seamless developer experience and be able to offer that as part of a broader platform. I think what you've seen, Brent, is that there's been other trends, things like graph and time series, where a lot of people are very excited about these kind of bespoke single-function technologies, but over time, they got subsumed into a broader platform because it didn't make sense for customers to have all these bespoke solutions which added so much complexity to their data architecture. I don't want to preempt what we're going to be talking about on June 22, but I encourage you to attend because that's where we'll share a little bit about our AI strategy.",
  "Brent Bracelin ",
  "Looking forward to it. Thank you.",
  "Operator",
  "Thank you. Our next question comes from the line of Kash Rangan of Goldman Sachs. Your question please, Kash.",
  "Kash Rangan",
  "Thank you very much. Congratulations on the quarter, great start to the year. One for Dev and one for Michael. Dev, you've talked about relation of database displacements for a while now, so how are those deployments coming along? And are you increasingly able to open the door for even bigger deployments in the future? That's one. And one for you, Michael. It now appears that you have a cadence where you -- despite challenging consumption trends on a per-customer basis, you've been able to add new customers at record pace, so results have been actually quite resilient. So how does this make you think about the business model ahead? I mean, are you at a point where the new customer momentum more than offsets declining consumption growth trends that you have better visibility into your business than you did probably, say, a year back, six months back? Thank you so much.",
  "Dev Ittycheria",
  "Yes, what I would say is, I think, in the short term, the consumption trends are clearly tied to our customers' underlying business. The only way we can really influence that is, over the long term by acquiring more and more workloads either through from existing customers or acquiring new customers. And so, we're really focused on what we can control, which is all about acquiring new customers and new workloads. And obviously there'll be puts and takes in every quarter, but our go-to-market organization is very, very focused on this. And we do that not just from our sales organization but also from our self-serve business. And then we also just don't just focus on acquiring but also making sure they're onboarded properly, they're serviced properly so that those workloads grow well and the customer's experience with those workloads is very positive so they continue to add new workloads to our platform. That's ultimately the things that we can control and that's what we're really focused on. And you talked about...",
  "Kash Rangan",
  "[indiscernible]",
  "Dev Ittycheria",
  "Yes. Sorry. So we are seeing -- again, part of acquiring a workload is acquiring a relational workload and replatforming it on MongoDB, so when we say acquiring a workload, you should not always assume it's a new workload. It could be an existing workload that people want to replatform. We talked about the China Mobile example where it was a very, very large workload servicing a very, very large user population. And they just weren't getting the performance benefits that they needed for such a large set of -- such a large implementation, so that was their catalyst to basically migrate to MongoDB. And I want to be clear. There's always going to be some catalyst. There's got to be some compelling event for a customer to do so. It could be for cost reasons. It could be for performance reasons like in China Mobile. Or it could be that they're -- they can't add new features fast enough on a brittle legacy platform so they need to migrate to a new modern platform where they continue to service their own business well. So those are the drivers and that's a big focus for us as well.",
  "Operator",
  "Thank you. Our next question comes from the line of Karl Keirstead of UBS. Your question please, Karl.",
  "Karl Keirstead",
  "Thank you. Maybe this will go to Mike. Mike, if we could unpack the 2Q guide a little bit. First, on the $10 million onetime lift from Alibaba, if you could just clarify the entirety of that lens in other subscription. None of it lands in Atlas or EA. And is there any follow-through on that, Alibaba? Or is it truly onetime 2Q? And then I've got a quick follow-up.",
  "Michael Gordon",
  "Yes. So it will show up -- first of all, it's not just Alibaba in the $10 million, but Alibaba is the one that people understand and know and we had a joint press release about. And it's certainly driving a healthy chunk of that. It does show up in that kind of other, other line, so it's not showing up in Atlas or in the EA line items, just for sort of clarity around the geography. The extension of the deal, we initially signed a multiyear deal with them. This extends that contract. The structure has minimum commitment levels, and so what runs through the P&L is the minimum commitment level. So obviously, to the extent that there is outperformance above this further increased level, like, that could impact things. We have seen those historically. That's part of what led to the early renewal and extension given the success of the joint offering. Over the time since we've launched it, we've seen an 8 times increase in their end user consumption. And so that's what sort of gave them and obviously us collectively the confidence to sort of extend that.",
  "Karl Keirstead",
  "Okay, great. Thanks, Mike. And then further on the 2Q guide, the three extra days relative to Q1, does that loosely offer kind of an added three point sequential boost? And then secondly, in terms of the overall demand assumptions you're using to drive that 2Q guide, is it sort of similar broader trends that you've seen in the last couple of months? Or Mike, are you assuming things get better or things get a little worse? Thanks. And that's it for me.",
  "Michael Gordon",
  "Yes. So you're correct. The Q2 days, it does affect because it's consumption and it's recognized as it's utilized. So that is a tailwind to Q2 relative to Q1 by those few extra days. The -- in terms of the broader assumptions, the primary driver of the increase in the fiscal 2024 full year guide is the fact that Atlas outperformed in Q1. Therefore, our starting Atlas ARR for Q2 is higher. We have not changed our outlook for the expected growth over the balance of the year. And so, we're not seeing things get worse. We're not assuming things get better or deteriorate further, and so it's consistent with our view that we had 90 days ago.",
  "Karl Keirstead",
  "Yes. Super helpful. Thanks Mike.",
  "Michael Gordon",
  "Thank you.",
  "Operator",
  "Thank you. Our next question comes on the line of Tyler Radke of Citi. Your question please, Tyler.",
  "Tyler Radke",
  "Yes. Thanks very much for taking the question. So Dev, in your opening remarks, you talked about how AI can kind of provide a new opportunity for modernization of existing applications. And I'm just curious, from your perspective, how you see this playing out. Or do you -- when do you think that this starts to accelerate the pace in which companies modernize their apps? And maybe how you're preparing your go-to-market team to tackle that opportunity.",
  "Dev Ittycheria",
  "Yes. Tyler, we're already seeing high customer engagement of customers already talking to us about new AI use cases that they want to build and run on MongoDB, so that's obviously a very positive trend. Again it's early days, so I don't want to suggest that there'll be some step function increase in consumption or revenue, but the trend is obviously real. As I mentioned, we already saw like over 200 customers who are AI companies who are deploying apps on MongoDB. And I would argue that there's an emerging trend that Atlas is one of the preferred places for AI companies to go to build apps, and so we feel really good about our positioning.",
  "And I think we feel like it will be definitely a tailwind given that with all of the AI assist tools around cogeneration and improving developer productivity, the capacity of a development team in a typical organization will only increase. There's statistics that say it can increase anywhere from 15% to 30%, 40%. I think it's still early days to determine what percent is real, but it will definitely increase, which by definition will increase the number of applications developed, which will then obviously drive more demand for MongoDB.",
  "Tyler Radke",
  "That's helpful. And I assume the answer is too early, but as you look at those 200 customers or so and maybe some existing ones that were already on the platform, is there any way to think about quantifying the AI-related revenue and -- or maybe where you think about that for the full year?",
  "Dev Ittycheria",
  "I think it's way too early, Tyler. I think it's also really tied to the market and the product market fit of those customers' businesses because obviously, if those customers do well, then we're a beneficiary. If they're not doing well, then obviously they're not going to drive a lot of consumption. So it's really tied to the product market fit of those companies, but the general trend that we are very pleased about is that, there's a lot of people leaning towards MongoDB in terms of thinking about the next set of AI apps that they're building.",
  "Tyler Radke",
  "Great. Thank you.",
  "Dev Ittycheria",
  "Thanks, Tyler.",
  "Operator",
  "Thank you. Our next question comes from the line of Jason Ader of William Blair. Your question please, Jason.",
  "Jason Ader",
  "Thank you. I just wanted to ask about the linearity of consumption through the quarter and then any comments you have on consumption in the month of May?",
  "Michael Gordon",
  "Yes. So I'd say clearly March and April were better than we expected given the outperformance of our revenue numbers. And so that's great to see. In general what we've seen since the start of the slowdown is certainly some month-to-month variability, but in general, like, some pretty reasonable ranges. And to the extent that when we see ranges that diverge at the start of Q2, the more pronounced holiday slowdown that we saw, we tend to call those out, but we feel that we've seen a pretty consistent level of sort of macro-affected or post-macro growth rates of existing expansion. That was what was included in our guide and that's what's initially for fiscal 2024. And that's also what's in our guide for the balance of the year.",
  "Jason Ader",
  "Okay, just -- yes. I mean what's a little hard to reconcile is I understand the sort of onetime pop in Q2, but for the back half, I mean, it just seems like growth is going to slow down massively year-over-year. I'm just trying to understand. If you're not assuming anything different on the macro, why would that be the case?",
  "Michael Gordon",
  "Yes. So what I would say is, when we look at it, you've got a higher starting Q2 ARR as a result of the strong Q1 performance. And as you flow through the same cohort expansion, for lack of a better phrase, over the balance of the year, that's what leads to the improved revenue outlook that we have. And so, we're actually seeing stronger growth on a year-over-year basis for the back half of the year than we thought at the beginning of the year.",
  "Jason Ader",
  "Got you, all right. And then one quick last one for you, Michael, on the gross margin outlook. I think your long term -- unless it changed, I think it was 70%. And you're running now in the mid-70s. It seems like Atlas has really been above your expectations in terms of the gross margin. Any comments on just sort of like, call it, the next couple of years on gross margin?",
  "Michael Gordon",
  "Yes. So we have not specifically guided to gross margin. You are correct. We have outperformed our expectations on gross margin. Our gross margin progression plan, particularly as it relates to Atlas has been very strong. I would not have forecast such high gross margins with Atlas at almost two-thirds of our revenue. And so we've continued to execute incredibly well there.",
  "I would just go back to your comment around sort of our long-term target model was 70-plus. And so I think I feel significantly more confident in delivering against that now that we've got Atlas at a much higher percent of the revenue. Atlas still is dilutive on a margin basis, but clearly we've meaningfully narrowed that gap and outperformed our own plan, both in terms of the rate and pace of achieving the improvements, as well as, as we've kind of pulled additional levers, we've gotten more value out of the levers that we had identified along the way. And that's what's put us in this strong position.",
  "Jason Ader",
  "Thanks guys.",
  "Operator",
  "Thank you. Our next question comes line of Fred Havemeyer of Macquarie Capital. Your question please, Fred.",
  "Fred Havemeyer",
  "Thank you. I wanted to also follow up on margins with respect to Atlas. I think, as your company is going through a transition from, of course, like more term licenses, towards Atlas being more of a consumption-based model, it's exciting to see the margin upside flowing through as revenue is coming through, but I wanted, I think, a refresher on how to think about just essentially unit -- sorry, just on how to think about margin progression with Atlas in play. Just generally, once customers have signed and you are through that period of, of course, recognizing commissions, et cetera, and customers are expanding on that Atlas, how should we think about that incremental revenue contribution contributing, of course, to profitability?",
  "Michael Gordon",
  "Sure. So I'll try and tackle it a couple of different ways, Fred. So I think in general what you see is Atlas revenue is consumption oriented. I think people understand that. We have this very close value linkage, and so it maps quite tightly to the underlying application usage for our customers and their end users. And so I think the key thing when you compare it to the 606 implications particularly of enterprise advanced and the term license revenue is, while it's not ratable -- and I do think sometimes there's the tendency to confuse it was ratable. It is spread over the duration. If we just assume a one year contract, which most of our contracts are, you'll get the same revenue over the time, but with the enterprise license -- enterprise events license, you'll see that upfront revenue being lumpier, right? That's part of the reason why we talk about and go to great pains to explain the EA compares and some of those other things. So that's really the big driver. You get the same revenue, but there's less upfront.",
  "I think the other thing that's important to understand in terms of the financials is really the cash flow dynamics and understanding that. As we've talked about for the last several years, we've been deemphasizing upfront commitments, trying to reduce the level of friction, trying to focus on acquiring more workloads and getting more workloads on the platform. And the result of that is spending less time on upfront commitments. Atlas now has -- about 80% of Atlas does not flow through deferred. And so that's just a very different dynamic when you start thinking about less from the income statement but more kind of away from the other parts of the balance sheet and some of the other calculations that you all do.",
  "Fred Havemeyer",
  "Thank you very much.",
  "Operator",
  "Thank you. Our next question comes from the line of Kingsley Crane of Canaccord. Your question please, Kingsley.",
  "Kingsley Crane",
  "Great, yes. So I would like to ask a question about the replacement opportunity and in just a slightly different way. So we're all excited about this AI theme. I know this is more longer term, but do you think that AI workloads creation, app replatforming can act as a catalyst for share shifts as relational DBs are less prepared to support these workloads?",
  "Dev Ittycheria",
  "I think, over the long term, that's definitely the case. I think you're seeing that, I mean, people forget that the relational database has been around for almost 45 years, right? So -- and so it's a technology that's worked well for a long period of time, but it really doesn't suit the needs of modern applications. And as applications get more and more sophisticated, have more performance and scale requirements, people need to consider moving to more scalable platforms and that's our strength. And China Mobile, again, is a great example of that. And that's not even AI apps.",
  "Kingsley Crane",
  "Okay. Great. Thank you.",
  "Operator",
  "Thank you. [Operator Instructions] Our next question comes from the line of Michael Turits of KeyBanc. Your line is open, Michael.",
  "Michael Turits",
  "Hi, guys. Good evening. So I want to come back to the usage trends. So I want -- maybe explain it, but I'm not sure. So what really drove the better-than-expected usage in 1Q? I know you said that execution was great, which is awesome. And then [Multiple Speakers] in terms of expectations for the rest of the year?",
  "Michael Gordon",
  "Sorry. Say the last part of the question again, Michael.",
  "Michael Turits",
  "So what drove the better-than-expected usage in Q1? But then for the rest of the year, you're expecting a return to your prior assumptions regarding usage growth.",
  "Dev Ittycheria",
  "Yes. So let me try and clarify it. So first, the strong execution, I think, that Dev was talking about really ties more to the new business environment, which remember is very valuable for the medium to long term, but the near term is much more governed by the performance of existing applications. So that, what drove the outperformance of that was stronger underlying usage of those applications, right? So when you think about the underlying queries, right, the reads and writes of those applications, more activity. That drove more consumption and so that's what drove the outperformance.",
  "And when you think about the -- as I mentioned, there's a little bit of variability period to period, but other than sort of the start of the downturn in Q2 of last year and the more pronounced holiday slowdown, it's been in a fairly reasonable range. That was the range that we've seen the performance in for Q1. That's the range that we saw the performance was -- in our Q1, our guide at the beginning of the year for the full year. And so there's no real reason to change that outlook for the balance of the year. We're not assuming things get materially better. We're not assuming things get materially worse, and we don't have any data that would suggest either of those directions.",
  "Michael Turits",
  "And then just a quick follow-up. I know you talked about Atlas not running through deferred, but it was actually EA that was a little stronger this quarter. So what would maybe explain it? But why did we see that sequential decline in deferred revenue that we haven't typically seen?",
  "Michael Gordon",
  "Yes. I go back to a couple of thoughts. One, billings in general is not a super helpful metric for us. And I know we've said that for -- really since going public, I guess, but it -- increasingly, I think that, that is true. Certainly, as roughly two-third of the business is Atlas and as I mentioned, about 80% of that does not flow through deferreds, but also what that means is that a larger portion of what will run through deferreds is EA. And you saw EA grew more slowly on a year-over-year basis. And Q1 tends to be a seasonally slower quarter for new EA business.",
  "Michael Turits",
  "Okay. All right. Mike and Dev. Thanks very much.",
  "Michael Gordon",
  "Thanks.",
  "Operator",
  "Thank you. Our next question comes from the line of Mike Cikos of Needham. Your question please, Mike.",
  "Michael Cikos ",
  "Hi, guys. Can you hear me all right? I apologize. The operator might have tuned...",
  "Brian Denyeau",
  "Yes, all good, no problem.",
  "Michael Cikos ",
  "Awesome. If I could just follow up on Michael's last question there. And one of the things I wanted to highlight, on that EA strength in Q1, I believe we were expecting EA to actually decline sequentially. And you guys delivered some slight outperformance there. And I guess, broadly if we look back over the last couple of quarters, EA has really outperformed expectations. Can you help us think through what is driving that EA outperformance; and I guess, with more specific color to Q1, where that outperformance came from?",
  "Dev Ittycheria",
  "Yes. You have to -- thanks for your question, Mike. You have to remember that one of our strengths is people can run MongoDB anywhere. And there's still a large percentage of workloads and a lot of customers who still run a lot of important workloads on premise. I think the journey to the cloud is far from over. And the attraction of starting with MongoDB on premise is that they, customers then get optionality to -- at some point in time, if they ever choose to move to the cloud, they don't have to rewrite the application. It's a much more graceful migration than having to replatform on to another technology when they want to move that workload to the cloud. So that is a very attractive part of the MongoDB value proposition.",
  "And beyond that, obviously, [indiscernible] is people value MongoDB's ability with a flexible document model. The highly distributed and scalable platform just gives enormous benefits whether it's on-prem or in the cloud. And so, that's something that people also value, so we still see a lot of demand. Obviously Atlas is the biggest growth engine of our business, but there's still a lot of customers who lean into EA.",
  "Michael Gordon",
  "Yes. I would just add, we were expecting enterprise events to be down. And so the fact that it had a slight sequential gain, It was great to see and speaks to all the points Dev is underscoring. I would just remind people that, to the point, EA did have a very strong year last year. And so we do face very difficult compares throughout the year on enterprise advanced. And I just think it's important to understand that because you can see the slower growth rate on EA shining through in Q1.",
  "Michael Cikos ",
  "No, that's great. And I appreciate you reiterating the difficult comps there, Michael. I think, if I can just follow up with a two parter, maybe more for Dev here, but first, I know that you're really citing the sharp execution from the go-to-market teams with respect to the number of new workloads or customer wins. I wanted to sanity check. Has relational migrator in any way played a role in landing these workloads and customers? That's the first part. And the second part would be can you just give us an update on how the investments are tracking as far as enhancing features around time series and search capabilities on MongoDB.",
  "Dev Ittycheria",
  "Yes. So on the first question, again while we do have customers, some customers, migrating relational workloads to MongoDB, I would not say relational migrator was a huge lever in making that happen. We're very excited about the prospects of relational migrator and helping to reduce the cost and time to migrate relational apps to MongoDB, but we're still early in that journey.",
  "With regards to time series and some of the other capabilities, we feel really good about the platform. Uptake is high. And we plan to do a pretty broad set of announcements at our MongoDB.local New York on June 22, so stay tuned for some announcements then.",
  "Michael Cikos ",
  "That's great. I'll see you guys in New York in June. Thank you very much.",
  "Dev Ittycheria",
  "We look forward to it.",
  "Operator",
  "Thank you. Our next question comes from the line of Firoz Valliji of Alliance Bernstein. Your question please, Firoz.",
  "Firoz Valliji",
  "Hi. Thank you taking my question and congrats on a great quarter. Maybe, the first one on the consumption trends. So you have talked about revenue being linked to consumption. And we have seen consumption level come down over the past few quarters. Is it fair to assume that, in next couple of quarters, consumption level may reset at a new normal and then maybe resume growth from that level? Or is it hard to call bottom on the per-user consumption level? And then I have a follow-up. Thank you.",
  "Michael Gordon",
  "Yes. So what I'd say is we have -- I would just say, when we look at our outlook, there's no reason, based on the data that we have, to assume things get materially better or materially worse. And that's what's included in our guidance for the balance of the year. And that's consistent with what we thought in last quarter's call, when we provided our initial view. And when we look at where we are now and the outlook, I think that's the right view, so I don't think that there's any particular data that would point to things suddenly becoming better or becoming materially worse.",
  "Firoz Valliji",
  "Got it. And so recently, we heard from another data platform [indiscernible] seeing some of the customers move data out of the platform to maybe economize on costs. Are you seeing anything similar? Or do you see pockets of workloads where that might occur on MongoDB's platform as well?",
  "Dev Ittycheria",
  "Yes. So if I understood your question, you're saying are people moving -- you've seen other companies have talked about customers moving data out of their platforms. We have not seen that trend. As we said, our consumption is tied to the application usage. And you have to remember, if customer builds an application, they want that application to be used, so if the application is not being used, in some ways, that's not a good thing for a customer. That being said, our revenue is driven by usage, so when usage goes up, our revenue goes up. And when usage goes down, our revenue goes down, but it's very linked to the underlying trends of that customer's business, so the link to -- from value to price is highly correlated. So we don't have customers who are â\u0080\u009ctrying to move data off Atlasâ\u0080\u009d. That's not a phenomenon that we see.",
  "Firoz Valliji",
  "Perfect. Thanks. Itâ\u0080\u0099s very helpful.",
  "Operator",
  "Thank you. Our next question comes from the line of Howard Ma of Guggenheim Partners. Your question please, Howard.",
  "Howard Ma",
  "Thank you squeezing me in off the hour mark. Can you just quickly comment on whether or not relational migrations are contributing more to growth relative to greenfield plus subsequent expansion? And if you could frame that within the 2,300 net adds in the quarter too, that would be great. Thank so much.",
  "Michael Gordon",
  "Yes, sure. Thanks for the question, Howard. No, I would say generally consistent is what we've seen. I wouldn't particularly call out a particular spike up. Obviously there's the China Mobile case study or vignette that Dev walked through, and you can always find those in every quarter. It continues to be a healthy part of the business, but I wouldn't uniquely call that out as sort of particularly driving the results, although it's obviously a big part of our long-term market opportunity.",
  "Howard Ma",
  "Okay. Great. Thanks so much.",
  "Michael Gordon",
  "Thank you.",
  "Operator",
  "Thank you. I would now like to turn the conference back to Dev Ittycheria for closing remarks. Sir?",
  "Dev Ittycheria",
  "Thank you. I just want to again just close by saying that we had another strong quarter of new business performance, while Atlas consumption rebounded from last quarter. We remain laser-focused on our North Star, which is acquiring new workloads from both new and existing customers. We do believe AI will increase the velocity of software development and, in turn, the number and sophistication of new applications developed. And we believe that this increase -- this will increase demand for powerful and comprehensive platforms like MongoDB over the long term.",
  "So with that, we want to thank you for your time today. And we look forward to seeing you on June 22 at the Javits Center in New York City. Thank you.",
  "Operator",
  "This concludes today's conference call. Thank you for participating. You may now disconnect."
]